[
  {
    "title": "Stagflation on the Fed’s mind",
    "url": "https://www.cnbc.com/2025/06/19/cnbc-daily-open-stagflation-on-the-feds-mind.html",
    "date": "2025-06-18",
    "content": "Stagflation on the Fed’s mind\nSummary:\nPre-Markets\nU.S. Markets\nEurope Markets\nChina Markets\nAsia Markets\nWorld Markets\nCurrencies\nCryptocurrency\nFutures & Commodities\nBonds\nFunds & ETFs\nEconomy\nFinance\nHealth & Science\nMedia\nReal Estate\nEnergy\nClimate\nTransportation\nIndustrials\nRetail\nWealth\nSports\nLife\nSmall Business\nPersonal Finance\nFintech\nFinancial Advisors\nOptions Action\nETF Street\nBuffett Archive\nEarnings\nTrader Talk\nCybersecurity\nAI\nEnterprise\nInternet\nMedia\nMobile\nSocial Media\nCNBC Disruptor 50\nTech Guide\nWhite House\nPolicy\nDefense\nCongress\nExpanding Opportunity\nEurope Politics\nChina Politics\nAsia Politics\nWorld Politics\nLatest Video\nFull Episodes\nLivestream\nTop Video\nLive Audio\nEurope TV\nAsia TV\nCNBC Podcasts\nCEO Interviews\nDigital Originals\nTrust Portfolio\nAnalysis\nTrade Alerts\nMeeting Videos\nHomestretch\nJim’s Columns\nEducation\nSubscribe\nSign In\nPro News\nLivestream\nFull Episodes\nStock Screener\nMarket Forecast\nOptions Investing\nChart Investing\nStock Lists\nSubscribe\nSign In\nMake It\nselect\nUSA\nINTL\nLivestream\nLivestream\nThe U.S. Federal Reserve on Wednesday kept interest rates in a range between 4.25%-4.5% and kept two cuts in 2025 on the table.\nInflation in the U.S., measured by the personal consumption expenditures price index, will rise beyond 3% in 2025, according to an updated Fed forecast.\nU.S. stocks and oil prices were little changed Wednesday. Europe’s Stoxx 600 index fell.\nU.S President Donald Trump insisted he had not yet decided whether to order a U.S. strike on Iran.\nA regime change in Iran resulting from U.S. or Israeli military action can have a “profound impact” on the global oil market, JPMorgan said.\n.SPX-1.85 (-0.03%)\n.DJI-44.14 (-0.10%)\n.IXIC+25.18 (+0.13%)\n.STOXX-2.18 (-0.40%)\n.FTSE-22.57 (-0.26%)\nSubscribe to CNBC PRO\nSubscribe to Investing Club\nLicensing & Reprints\nCNBC Councils\nSupply Chain Values\nCNBC on Peacock\nJoin the CNBC Panel\nDigital Products\nNews Releases\nClosed Captioning\nCorrections\nAbout CNBC\nInternships\nSite Map\nAd Choices\nCareers\nHelp\nContact\nNews TipsGot a confidential news tip? We want to hear from you.Get In Touch\nCNBC NewslettersSign up for free newsletters and get more CNBC delivered to your inboxSign Up NowGet this delivered to your inbox, and more info about our products and services.\nAdvertise With UsPlease Contact Us\nPrivacy Policy\nCA Notice\nTerms of Service\nBody:\nIn this article\nTaken from CNBC’s Daily Open, our international markets newsletter —Subscribe today\nAt U.S. Federal Reserve Chair Jerome Powell’spost-meeting press conference, the topic of tariffs — specifically, their impact on prices — was a recurring one.\n“Everyone that I know is forecasting a meaningful increase in inflation in coming months from tariffs because someone has to pay for the tariffs,” Powell said. “And some of it will fall on the end consumer.”\nGranted, recent economic data has been upbeat, suggesting the U.S. economy has been able to — and could still — escape from tariffs mostly unscathed.\nIn May, a better-than-expected139,000 jobs were addedand the unemployment rate was unchanged at 4.2%.Consumer sentiment in early Junewas much more optimistic than forecast, according to a University of Michigan survey. And, most crucially,inflation in May— based on the consumer price index — ticked up just 0.1% for the month, lower than estimated.\nBut that string of positive data might have to thank the slow process by which tariffs move through the economy.\n“It takes some time for tariffs to work their way through the chain of distribution to the end consumer. A good example of that would be goods being sold at retailers today may have been imported several months ago before tariffs were imposed. So we’re beginning to see some effects, and we do expect to see more of them over the coming months,” Powell said.\nAnd even though Fed officials, at present, “don’t see signs” of the U.S. economy weakening, Powell acknowledged growth will slow “eventually.” In other words, stagflation — the toxic mix of higher prices and slower growth — could be a possibility in the months ahead.\nThe song “I Got Summer on My Mind” went viral in 2022. “I Got Stagflation on My Mind” could be the Fed’s — and market watchers’ — earworm this summer.\nU.S. central bank holds rates, sees two cutsThe U.S. Federal Reserve on Wednesday keptinterest rates in a range between 4.25%-4.5%, where it has been since December. Along with the rate decision, the committee indicated, through its closely watched “dot plot,” that two cuts by the end of 2025 are still on the table. Earlier Wednesday, President Donald Trump said the fed funds rate should be at least 2 percentage points lower, and again slammed Chair Jerome Powell,calling him “stupid.”\nFed hikes inflation and lowers growth forecastsInflation in the U.S., measured by the personal consumption expenditures price index, will rise beyond 3% in 2025, according to an updated Fed forecast. The central bank had in March expected the PCE to hit 2.8%. The PCE came in atjust 2.1% in April. The Fed also sees economic growth slowing to 1.4% this year, down from an earlier estimate of 1.7%. In combination, both forecasts point toearly signs of stagflation.\nMarkets and oil prices were flat in U.S.U.S. stockshovered around the flatline Wednesday. TheS&P 500slipped 0.03%, theDow Jones Industrial Averageclosed 0.1% down, but theNasdaq Compositeinched up 0.13%. Oil prices, likewise, were little changed. Europe’s regionalStoxx 600indexlost 0.36%.TheFTSE 100, however, ticked up 0.11% as data showed U.K. annual inflation coming in at anexpected 3.4% in May.\nTrump says he hasn’t decided on Iran strikesFor the second time in two days, Trump on Wednesdaymet his national security team in the White Houseamid the Israel-Iran conflict. The closed-door gathering took place as Trump insisted he had not yet decided whether to order a U.S. strike on Iran. The same day, U.S. Ambassador to Israel Mike Huckabee said evacuation flights and cruise ship departures were being arranged for American citizens seeking to leave Israel.\n[PRO]‘Profound impact’ on oil market: JPMorganThe current jump in oil prices because of the simmering conflict in the Middle East might not lead to a long-term price shock, according to historical data analyzed byJPMorgan. A regime change in Iran resulting from U.S. or Israeli military action, however, can have a “profound impact” on the global oil market, the bank said.\nThese are the sticking points holding up a U.S.-EU trade deal\nThe U.S. and European Union are running out of time to strike a deal on trade tariffs — and analysts say several key sticking points could make an agreement impossible.\nNegotiations have been slow since both the U.S. and EU temporarily cut duties on each other until July 9. If a deal is not agreed by then,full reciprocal import tariffsof 50% on EU goods, and the bloc’swide-spanning countermeasuresare set to come into effect.\n“We’re talking, but I don’t feel that they’re offering a fair deal yet,” Trump told reporters Tuesday, further dashing hopes of an imminent agreement.\nSo what’s holding things up between the two sides, which had a relationshipworth1.68 trillion euros ($1.93 trillion) in 2024?\nGot a confidential news tip? We want to hear from you.\nSign up for free newsletters and get more CNBC delivered to your inbox\nGet this delivered to your inbox, and more info about our products and services.\n©2025CNBC LLC. All Rights Reserved.A Division of NBCUniversal\nData is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.\nData also provided by\nThis Cookie Notice (“Notice”) explains how NBCUniversal andits affiliates(“NBCUniversal” or “we”), along with our partners, including advertisers and vendors, use cookies and similar tracking technologies when you use our websites, applications, such as games, interactive TV, voice-activated assistants, and other services that link to this policy, as well as connected devices, including those used in our theme parks (“Services”). This Notice provides more information about these technologies, your choices, and is part of the NBCUniversal Privacy Policy availablehere. You should read the Privacy Policy and this Notice for a full picture of NBCUniversal’s use of your information.\nWHAT ARE COOKIES AND HOW ARE THEY USED?\nLike many companies, we use cookies (small text files placed on your computer or device) and other tracking technologies on the Services (referred to together from this point forward as “Cookies”, unless otherwise stated), including HTTP cookies, HTML5 and Flash local storage/flash cookies, web beacons/GIFs, embedded scripts, ETags/cache browsers, and software development kits.\nFirst-party Cookies\nFirst-party Cookies are placed by us (including through the use of third-party service providers) and are used to allow you to use the Services and their features and to assist in analytics activities.\nThird-party Cookies\nCertain third parties may place their Cookies on your device and use them to recognize your device when you visit the Services and when you visit other websites or online services. These third parties collect and use this information pursuant to their own privacy policies. Third-party Cookies enable certain features or functionalities, and advertising, to be provided on the Services.\nTypes of Cookies\nThe Services use the following types of first and third-party Cookies for these purposes:\nStrictly Necessary Cookies:These Cookies are required for Service functionality, including for system administration, security and fraud prevention, and to enable any purchasing capabilities. You can set your browser to block these Cookies, but some parts of the site may not function properly.\nInformation Storage and Access:These Cookies allow us and our partners to store and access information on the device, such as device identifiers.\nMeasurement and Analytics:These Cookies collect data regarding your usage of and performance of the Services, apply market research to generate audiences, and measure the delivery and effectiveness of content and advertising. We and our third-party vendors use these Cookies to perform analytics, so we can improve the content and user experience, develop new products and services, and for statistical purposes. They are also used to recognize you and provide further insights across platforms and devices for the above purposes.\nPersonalization Cookies:These Cookies enable us to provide certain features, such as determining if you are a first-time visitor, capping message frequency, remembering choices you have made (e.g., your language preferences, time zone), and assist you with logging in after registration (including across platforms and devices).  These Cookies also allow your device to receive and send information, so you can see and interact with ads and content.\nContent Selection and Delivery Cookies:Data collected under this category can also be used to select and deliver personalized content, such as news articles and videos.\nAd Selection and Delivery Cookies:These Cookies are used to collect data about your browsing habits, your use of the Services, your preferences, and your interaction with advertisements across platforms and devices for the purpose of delivering interest-based advertising content on the Services and on third-party sites. Third-party sites and services also use interest-based Advertising Cookies to deliver content, including advertisements relevant to your interests on the Services and third-party services. If you reject these Cookies, you may see contextual advertising that may be less relevant to you.\nSocial Media Cookies:These Cookies are set by social media platforms on the Services to enable you to share content with your friends and networks. Social media platforms have the ability to track your online activity outside of the Services. This may impact the content and messages you see on other services you visit.\nWe and third parties may associate Measurement And Analytics Cookies, Personalization Cookies, Content Selection, Delivery Cookies, and Reporting, Ad Selection, Delivery and Reporting Cookies, and Social Media Cookies with other information we have about you.\nCOOKIE MANAGEMENT\nDepending on where you live, you may be able to adjust your Cookie preferences at any time via the “Cookie Settings” link in the footer of relevant websites. You can also use the methods described below to manage Cookies. You must take such steps on each browser or device that you use. If you replace, change or upgrade your browser or device, or delete your cookies, you may need to use these opt-out tools again. As some Cookie-management solutions also rely on Cookies, please adjust your browser Cookie settings carefully, following the relevant instructions below.\nBrowser Controls: You may be able to disable and manage some Cookies through your browser settings. If you use multiple browsers on the same device, you will need to manage your settings for each browser. Please click on any of the below browser links for instructions:\nGoogle ChromeApple SafariMozila FirefoxMicrosoft Internet Explorer\nIf the browser you use is not listed above, please refer to your browser’s help menu for information on how to manage Cookies. Please be aware that disabling cookies will not disable other analytics tools we may use to collect information about you or your use of our Services.\nAnalytics Provider Opt-Outs:To disable analytics Cookies you can use the browser controls discussed above or, for some of our providers, you can use their individual opt-out mechanisms:\nGoogle’s Privacy PolicyandGoogle Analytics Opt-OutOmniture’s Privacy PolicyandOmniture’s Opt-OutMixpanel’s Privacy PolicyandMixpanel’s Opt-Out\nThe above are examples of our analytics providers and this is not an exhaustive list. We are not responsible for the effectiveness of any other providers’ opt-out mechanisms.\nFlash Local Storage:These cookies are also known as local shared objects and may be used to store your preferences or display content by us, advertisers and other third-parties. Flash cookies need to be deleted in the storage section of your Flash Player Settings Manager.\nInterest-Based Advertising:Most third-party advertisers offer a way to opt out of their interest-based advertising. For more information or to opt out of receiving interest-based advertising from participating third-party advertisers, depending on your country of residence, please visit:\nDigital Advertising Alliance in the USDigital Advertising Alliance of CanadaEuropean Interactive Digital Advertising AllianceAustralian Digital Advertising Alliance\nYou can also opt out of some of the advertising providers we use by visiting their opt-out pages:\nGoogle’s Privacy PolicyandGoogle Analytics Opt-Out PageFacebook Privacy PolicyandFacebook’s Opt-Out PageTwitter Privacy PolicyandTwitter’s Opt-Out PageLiveramp’s Privacy PolicyandLiveramp Opt-Out Page\nThese are examples of our advertising providers and this is not an exhaustive list. In addition, we are not responsible for the effectiveness of any of these providers’ opt-out mechanisms.\nAfter you opt out, you will still see advertisements, but they may not be as relevant to you.\nMobile Settings:You may manage the collection of information for interest-based advertising purposes in mobile apps via the device’s settings, including managing the collection of location data. To opt out of mobile ad tracking from Nielsen or other third parties, you can do so by selecting the “Limit Ad Tracking” (for iOS devices) or “Opt out of Ads Personalization” (for Android devices) options in your device settings.\nConnected Devices:For connected devices, such as smart TVs or streaming devices, you should review the device’s settings and select the option that allows you to disable automatic content recognition or ad tracking.  Typically, to opt out, such devices require you to select options like “limit ad tracking” or to disable options such as “interest-based advertising,” “interactive TV,” or “smart interactivity”.  These settings vary by device type.\nCross-Device Tracking:If you would like to opt out of our browser-based cross-device tracking for advertising purposes, you may do so by using the various methods described above.  You must opt out separately on each device and each browser that you use. For more information about cross-device matching, please visit the Network Advertising Initiative or the Digital Advertising Alliance. If you opt out of cross-device tracking for advertising purposes, we may still conduct cross-device tracking for other purposes, such as analytics.\nConsequences of Deactivation of Cookies: If you disable or remove Cookies, some parts of the Services may not function properly. Information may still be collected and used for other purposes, such as research, online services analytics or internal operations, and to remember your opt-out preferences.\nCONTACT US\nFor inquiries about this Cookies Notice, please contact us atPrivacy@nbcuni.comor Chief Privacy Officer, NBCUniversal Legal Department, 30 Rockefeller Plaza, New York, NY 10112, US.\nFor inquiries from users who reside in the European Economic Area, the United Kingdom or Switzerland, please contact us atPrivacy@nbcuni.comor Privacy, Legal Department, Central Saint Giles, St Giles High Street, London, WC2H 8NU, UK\nCHANGES TO THIS NOTICE\nThis Notice may be revised occasionally and in accordance with legal requirements. Please revisit this Cookie Notice regularly to stay informed about our and our analytic and advertising partners’ use of Cookies.\nThese Cookies are required for Service functionality, including security and fraud prevention, and to enable any purchasing capabilities. You can set your browser to block these Cookies, but some parts of the site may not function properly."
  },
  {
    "title": "Here’s how Wall Street is reacting to the Fed’s updated rate cut outlook",
    "url": "https://www.cnbc.com/2025/06/18/heres-how-wall-street-is-reacting-to-the-feds-updated-rate-cut-outlook.html",
    "date": "2025-06-18",
    "content": "Here’s how Wall Street is reacting to the Fed’s updated rate cut outlook\nSummary:\nPre-Markets\nU.S. Markets\nEurope Markets\nChina Markets\nAsia Markets\nWorld Markets\nCurrencies\nCryptocurrency\nFutures & Commodities\nBonds\nFunds & ETFs\nEconomy\nFinance\nHealth & Science\nMedia\nReal Estate\nEnergy\nClimate\nTransportation\nIndustrials\nRetail\nWealth\nSports\nLife\nSmall Business\nPersonal Finance\nFintech\nFinancial Advisors\nOptions Action\nETF Street\nBuffett Archive\nEarnings\nTrader Talk\nCybersecurity\nAI\nEnterprise\nInternet\nMedia\nMobile\nSocial Media\nCNBC Disruptor 50\nTech Guide\nWhite House\nPolicy\nDefense\nCongress\nExpanding Opportunity\nEurope Politics\nChina Politics\nAsia Politics\nWorld Politics\nLatest Video\nFull Episodes\nLivestream\nTop Video\nLive Audio\nEurope TV\nAsia TV\nCNBC Podcasts\nCEO Interviews\nDigital Originals\nTrust Portfolio\nAnalysis\nTrade Alerts\nMeeting Videos\nHomestretch\nJim’s Columns\nEducation\nSubscribe\nSign In\nPro News\nLivestream\nFull Episodes\nStock Screener\nMarket Forecast\nOptions Investing\nChart Investing\nStock Lists\nSubscribe\nSign In\nMake It\nselect\nUSA\nINTL\nLivestream\nLivestream\nFund managers are pouring money into emerging markets. Here’s where investors see opportunities\nThe so-called hard economic data is starting to raise some eyebrows\nFinancial advisors are turning to this asset class for diversification and stability\nThe big rally in this chip stock seems to have some legs, according to the charts\nSubscribe to CNBC PRO\nSubscribe to Investing Club\nLicensing & Reprints\nCNBC Councils\nSupply Chain Values\nCNBC on Peacock\nJoin the CNBC Panel\nDigital Products\nNews Releases\nClosed Captioning\nCorrections\nAbout CNBC\nInternships\nSite Map\nAd Choices\nCareers\nHelp\nContact\nNews TipsGot a confidential news tip? We want to hear from you.Get In Touch\nCNBC NewslettersSign up for free newsletters and get more CNBC delivered to your inboxSign Up NowGet this delivered to your inbox, and more info about our products and services.\nAdvertise With UsPlease Contact Us\nPrivacy Policy\nCA Notice\nTerms of Service\nBody:\nGot a confidential news tip? We want to hear from you.\nSign up for free newsletters and get more CNBC delivered to your inbox\nGet this delivered to your inbox, and more info about our products and services.\n©2025CNBC LLC. All Rights Reserved.A Division of NBCUniversal\nData is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.\nData also provided by\nThis Cookie Notice (“Notice”) explains how NBCUniversal andits affiliates(“NBCUniversal” or “we”), along with our partners, including advertisers and vendors, use cookies and similar tracking technologies when you use our websites, applications, such as games, interactive TV, voice-activated assistants, and other services that link to this policy, as well as connected devices, including those used in our theme parks (“Services”). This Notice provides more information about these technologies, your choices, and is part of the NBCUniversal Privacy Policy availablehere. You should read the Privacy Policy and this Notice for a full picture of NBCUniversal’s use of your information.\nWHAT ARE COOKIES AND HOW ARE THEY USED?\nLike many companies, we use cookies (small text files placed on your computer or device) and other tracking technologies on the Services (referred to together from this point forward as “Cookies”, unless otherwise stated), including HTTP cookies, HTML5 and Flash local storage/flash cookies, web beacons/GIFs, embedded scripts, ETags/cache browsers, and software development kits.\nFirst-party Cookies\nFirst-party Cookies are placed by us (including through the use of third-party service providers) and are used to allow you to use the Services and their features and to assist in analytics activities.\nThird-party Cookies\nCertain third parties may place their Cookies on your device and use them to recognize your device when you visit the Services and when you visit other websites or online services. These third parties collect and use this information pursuant to their own privacy policies. Third-party Cookies enable certain features or functionalities, and advertising, to be provided on the Services.\nTypes of Cookies\nThe Services use the following types of first and third-party Cookies for these purposes:\nStrictly Necessary Cookies:These Cookies are required for Service functionality, including for system administration, security and fraud prevention, and to enable any purchasing capabilities. You can set your browser to block these Cookies, but some parts of the site may not function properly.\nInformation Storage and Access:These Cookies allow us and our partners to store and access information on the device, such as device identifiers.\nMeasurement and Analytics:These Cookies collect data regarding your usage of and performance of the Services, apply market research to generate audiences, and measure the delivery and effectiveness of content and advertising. We and our third-party vendors use these Cookies to perform analytics, so we can improve the content and user experience, develop new products and services, and for statistical purposes. They are also used to recognize you and provide further insights across platforms and devices for the above purposes.\nPersonalization Cookies:These Cookies enable us to provide certain features, such as determining if you are a first-time visitor, capping message frequency, remembering choices you have made (e.g., your language preferences, time zone), and assist you with logging in after registration (including across platforms and devices).  These Cookies also allow your device to receive and send information, so you can see and interact with ads and content.\nContent Selection and Delivery Cookies:Data collected under this category can also be used to select and deliver personalized content, such as news articles and videos.\nAd Selection and Delivery Cookies:These Cookies are used to collect data about your browsing habits, your use of the Services, your preferences, and your interaction with advertisements across platforms and devices for the purpose of delivering interest-based advertising content on the Services and on third-party sites. Third-party sites and services also use interest-based Advertising Cookies to deliver content, including advertisements relevant to your interests on the Services and third-party services. If you reject these Cookies, you may see contextual advertising that may be less relevant to you.\nSocial Media Cookies:These Cookies are set by social media platforms on the Services to enable you to share content with your friends and networks. Social media platforms have the ability to track your online activity outside of the Services. This may impact the content and messages you see on other services you visit.\nWe and third parties may associate Measurement And Analytics Cookies, Personalization Cookies, Content Selection, Delivery Cookies, and Reporting, Ad Selection, Delivery and Reporting Cookies, and Social Media Cookies with other information we have about you.\nCOOKIE MANAGEMENT\nDepending on where you live, you may be able to adjust your Cookie preferences at any time via the “Cookie Settings” link in the footer of relevant websites. You can also use the methods described below to manage Cookies. You must take such steps on each browser or device that you use. If you replace, change or upgrade your browser or device, or delete your cookies, you may need to use these opt-out tools again. As some Cookie-management solutions also rely on Cookies, please adjust your browser Cookie settings carefully, following the relevant instructions below.\nBrowser Controls: You may be able to disable and manage some Cookies through your browser settings. If you use multiple browsers on the same device, you will need to manage your settings for each browser. Please click on any of the below browser links for instructions:\nGoogle ChromeApple SafariMozila FirefoxMicrosoft Internet Explorer\nIf the browser you use is not listed above, please refer to your browser’s help menu for information on how to manage Cookies. Please be aware that disabling cookies will not disable other analytics tools we may use to collect information about you or your use of our Services.\nAnalytics Provider Opt-Outs:To disable analytics Cookies you can use the browser controls discussed above or, for some of our providers, you can use their individual opt-out mechanisms:\nGoogle’s Privacy PolicyandGoogle Analytics Opt-OutOmniture’s Privacy PolicyandOmniture’s Opt-OutMixpanel’s Privacy PolicyandMixpanel’s Opt-Out\nThe above are examples of our analytics providers and this is not an exhaustive list. We are not responsible for the effectiveness of any other providers’ opt-out mechanisms.\nFlash Local Storage:These cookies are also known as local shared objects and may be used to store your preferences or display content by us, advertisers and other third-parties. Flash cookies need to be deleted in the storage section of your Flash Player Settings Manager.\nInterest-Based Advertising:Most third-party advertisers offer a way to opt out of their interest-based advertising. For more information or to opt out of receiving interest-based advertising from participating third-party advertisers, depending on your country of residence, please visit:\nDigital Advertising Alliance in the USDigital Advertising Alliance of CanadaEuropean Interactive Digital Advertising AllianceAustralian Digital Advertising Alliance\nYou can also opt out of some of the advertising providers we use by visiting their opt-out pages:\nGoogle’s Privacy PolicyandGoogle Analytics Opt-Out PageFacebook Privacy PolicyandFacebook’s Opt-Out PageTwitter Privacy PolicyandTwitter’s Opt-Out PageLiveramp’s Privacy PolicyandLiveramp Opt-Out Page\nThese are examples of our advertising providers and this is not an exhaustive list. In addition, we are not responsible for the effectiveness of any of these providers’ opt-out mechanisms.\nAfter you opt out, you will still see advertisements, but they may not be as relevant to you.\nMobile Settings:You may manage the collection of information for interest-based advertising purposes in mobile apps via the device’s settings, including managing the collection of location data. To opt out of mobile ad tracking from Nielsen or other third parties, you can do so by selecting the “Limit Ad Tracking” (for iOS devices) or “Opt out of Ads Personalization” (for Android devices) options in your device settings.\nConnected Devices:For connected devices, such as smart TVs or streaming devices, you should review the device’s settings and select the option that allows you to disable automatic content recognition or ad tracking.  Typically, to opt out, such devices require you to select options like “limit ad tracking” or to disable options such as “interest-based advertising,” “interactive TV,” or “smart interactivity”.  These settings vary by device type.\nCross-Device Tracking:If you would like to opt out of our browser-based cross-device tracking for advertising purposes, you may do so by using the various methods described above.  You must opt out separately on each device and each browser that you use. For more information about cross-device matching, please visit the Network Advertising Initiative or the Digital Advertising Alliance. If you opt out of cross-device tracking for advertising purposes, we may still conduct cross-device tracking for other purposes, such as analytics.\nConsequences of Deactivation of Cookies: If you disable or remove Cookies, some parts of the Services may not function properly. Information may still be collected and used for other purposes, such as research, online services analytics or internal operations, and to remember your opt-out preferences.\nCONTACT US\nFor inquiries about this Cookies Notice, please contact us atPrivacy@nbcuni.comor Chief Privacy Officer, NBCUniversal Legal Department, 30 Rockefeller Plaza, New York, NY 10112, US.\nFor inquiries from users who reside in the European Economic Area, the United Kingdom or Switzerland, please contact us atPrivacy@nbcuni.comor Privacy, Legal Department, Central Saint Giles, St Giles High Street, London, WC2H 8NU, UK\nCHANGES TO THIS NOTICE\nThis Notice may be revised occasionally and in accordance with legal requirements. Please revisit this Cookie Notice regularly to stay informed about our and our analytic and advertising partners’ use of Cookies.\nThese Cookies are required for Service functionality, including security and fraud prevention, and to enable any purchasing capabilities. You can set your browser to block these Cookies, but some parts of the site may not function properly."
  },
  {
    "title": "Fed sees preferred inflation gauge topping 3%,  higher than previous forecast",
    "url": "https://www.cnbc.com/2025/06/18/federal-reserve-dot-plot-and-economic-projection-june-2025.html",
    "date": "2025-06-18",
    "content": "Fed sees preferred inflation gauge topping 3%,  higher than previous forecast\nSummary:\nPre-Markets\nU.S. Markets\nEurope Markets\nChina Markets\nAsia Markets\nWorld Markets\nCurrencies\nCryptocurrency\nFutures & Commodities\nBonds\nFunds & ETFs\nEconomy\nFinance\nHealth & Science\nMedia\nReal Estate\nEnergy\nClimate\nTransportation\nIndustrials\nRetail\nWealth\nSports\nLife\nSmall Business\nPersonal Finance\nFintech\nFinancial Advisors\nOptions Action\nETF Street\nBuffett Archive\nEarnings\nTrader Talk\nCybersecurity\nAI\nEnterprise\nInternet\nMedia\nMobile\nSocial Media\nCNBC Disruptor 50\nTech Guide\nWhite House\nPolicy\nDefense\nCongress\nExpanding Opportunity\nEurope Politics\nChina Politics\nAsia Politics\nWorld Politics\nLatest Video\nFull Episodes\nLivestream\nTop Video\nLive Audio\nEurope TV\nAsia TV\nCNBC Podcasts\nCEO Interviews\nDigital Originals\nTrust Portfolio\nAnalysis\nTrade Alerts\nMeeting Videos\nHomestretch\nJim’s Columns\nEducation\nSubscribe\nSign In\nPro News\nLivestream\nFull Episodes\nStock Screener\nMarket Forecast\nOptions Investing\nChart Investing\nStock Lists\nSubscribe\nSign In\nMake It\nselect\nUSA\nINTL\nLivestream\nLivestream\nSubscribe to CNBC PRO\nSubscribe to Investing Club\nLicensing & Reprints\nCNBC Councils\nSupply Chain Values\nCNBC on Peacock\nJoin the CNBC Panel\nDigital Products\nNews Releases\nClosed Captioning\nCorrections\nAbout CNBC\nInternships\nSite Map\nAd Choices\nCareers\nHelp\nContact\nNews TipsGot a confidential news tip? We want to hear from you.Get In Touch\nCNBC NewslettersSign up for free newsletters and get more CNBC delivered to your inboxSign Up NowGet this delivered to your inbox, and more info about our products and services.\nAdvertise With UsPlease Contact Us\nPrivacy Policy\nCA Notice\nTerms of Service\nBody:\nThe Federal Reserve sees inflation rising again to top 3% this year amid the uncertainty around PresidentDonald Trump’s trade policies and intensifying geopolitical risk.\nFederal Open Market Committee participants said at their June meeting that they expect the core personalconsumption expenditures price index, which excludes food and energy, to increase at a 3.1% rate in 2025, higher than their prior forecast of 2.8% in March.\nThePCE price indexwas at 2.1% in April, matching its lowest level since February 2021. Excluding food and energy, core PCE stood at 2.5%. The latter is a gauge Fed officials believe to be a better measure of longer-term trends.\nCentral bank officials also see further slowing in economic growth, projecting the gross domestic project expanding just 1.4% this year. In March, they expected a 1.7% pace in GDP growth.\nFed ChairJerome Powellsaid in the post-meeting news conference that the recent uptick in inflation expectations could be tied to tariffs.\n“Everyone that I know is forecasting a meaningful increase in inflation in coming months from tariffs because someone has to pay for the tariffs,” Powell said. “It will be someone in that chain that I mentioned, between the manufacturer, the exporter, the importer, the retailer, ultimately somebody putting it into a good of some kind or just the consumer buying it.”\n“All through that chain, people will be trying not to be the ones who can take up the cost but ultimately, the cost of the tariff has to be paid. And some of it will fall on the end consumer,” he said.\nFed officials have been reluctant to lower rates, worrying that Trump’s tariffs could cause inflation to reaccelerate in the coming months. The conflict between Israel and Iran adds another wild card to the policy mix, as high oil prices could prevent the Fed from easing policy.\nStill, the so-called dot plot — which indicates individual members’ expectations for rates — showed officials see their benchmark lending rate falling to 3.9% by the end of 2025. That’s equivalent to a target range of 3.75% to 4%, pointing to two reductions later this year.\nSeven of the 19 participants indicated they wanted no cuts this year, up from four in March. Participants also see fewer cuts in 2026 and 2027.\nHere are the Fed’s latest targets from 19 FOMC members, both voters and nonvoters:\nGot a confidential news tip? We want to hear from you.\nSign up for free newsletters and get more CNBC delivered to your inbox\nGet this delivered to your inbox, and more info about our products and services.\n©2025CNBC LLC. All Rights Reserved.A Division of NBCUniversal\nData is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.\nData also provided by\nThis Cookie Notice (“Notice”) explains how NBCUniversal andits affiliates(“NBCUniversal” or “we”), along with our partners, including advertisers and vendors, use cookies and similar tracking technologies when you use our websites, applications, such as games, interactive TV, voice-activated assistants, and other services that link to this policy, as well as connected devices, including those used in our theme parks (“Services”). This Notice provides more information about these technologies, your choices, and is part of the NBCUniversal Privacy Policy availablehere. You should read the Privacy Policy and this Notice for a full picture of NBCUniversal’s use of your information.\nWHAT ARE COOKIES AND HOW ARE THEY USED?\nLike many companies, we use cookies (small text files placed on your computer or device) and other tracking technologies on the Services (referred to together from this point forward as “Cookies”, unless otherwise stated), including HTTP cookies, HTML5 and Flash local storage/flash cookies, web beacons/GIFs, embedded scripts, ETags/cache browsers, and software development kits.\nFirst-party Cookies\nFirst-party Cookies are placed by us (including through the use of third-party service providers) and are used to allow you to use the Services and their features and to assist in analytics activities.\nThird-party Cookies\nCertain third parties may place their Cookies on your device and use them to recognize your device when you visit the Services and when you visit other websites or online services. These third parties collect and use this information pursuant to their own privacy policies. Third-party Cookies enable certain features or functionalities, and advertising, to be provided on the Services.\nTypes of Cookies\nThe Services use the following types of first and third-party Cookies for these purposes:\nStrictly Necessary Cookies:These Cookies are required for Service functionality, including for system administration, security and fraud prevention, and to enable any purchasing capabilities. You can set your browser to block these Cookies, but some parts of the site may not function properly.\nInformation Storage and Access:These Cookies allow us and our partners to store and access information on the device, such as device identifiers.\nMeasurement and Analytics:These Cookies collect data regarding your usage of and performance of the Services, apply market research to generate audiences, and measure the delivery and effectiveness of content and advertising. We and our third-party vendors use these Cookies to perform analytics, so we can improve the content and user experience, develop new products and services, and for statistical purposes. They are also used to recognize you and provide further insights across platforms and devices for the above purposes.\nPersonalization Cookies:These Cookies enable us to provide certain features, such as determining if you are a first-time visitor, capping message frequency, remembering choices you have made (e.g., your language preferences, time zone), and assist you with logging in after registration (including across platforms and devices).  These Cookies also allow your device to receive and send information, so you can see and interact with ads and content.\nContent Selection and Delivery Cookies:Data collected under this category can also be used to select and deliver personalized content, such as news articles and videos.\nAd Selection and Delivery Cookies:These Cookies are used to collect data about your browsing habits, your use of the Services, your preferences, and your interaction with advertisements across platforms and devices for the purpose of delivering interest-based advertising content on the Services and on third-party sites. Third-party sites and services also use interest-based Advertising Cookies to deliver content, including advertisements relevant to your interests on the Services and third-party services. If you reject these Cookies, you may see contextual advertising that may be less relevant to you.\nSocial Media Cookies:These Cookies are set by social media platforms on the Services to enable you to share content with your friends and networks. Social media platforms have the ability to track your online activity outside of the Services. This may impact the content and messages you see on other services you visit.\nWe and third parties may associate Measurement And Analytics Cookies, Personalization Cookies, Content Selection, Delivery Cookies, and Reporting, Ad Selection, Delivery and Reporting Cookies, and Social Media Cookies with other information we have about you.\nCOOKIE MANAGEMENT\nDepending on where you live, you may be able to adjust your Cookie preferences at any time via the “Cookie Settings” link in the footer of relevant websites. You can also use the methods described below to manage Cookies. You must take such steps on each browser or device that you use. If you replace, change or upgrade your browser or device, or delete your cookies, you may need to use these opt-out tools again. As some Cookie-management solutions also rely on Cookies, please adjust your browser Cookie settings carefully, following the relevant instructions below.\nBrowser Controls: You may be able to disable and manage some Cookies through your browser settings. If you use multiple browsers on the same device, you will need to manage your settings for each browser. Please click on any of the below browser links for instructions:\nGoogle ChromeApple SafariMozila FirefoxMicrosoft Internet Explorer\nIf the browser you use is not listed above, please refer to your browser’s help menu for information on how to manage Cookies. Please be aware that disabling cookies will not disable other analytics tools we may use to collect information about you or your use of our Services.\nAnalytics Provider Opt-Outs:To disable analytics Cookies you can use the browser controls discussed above or, for some of our providers, you can use their individual opt-out mechanisms:\nGoogle’s Privacy PolicyandGoogle Analytics Opt-OutOmniture’s Privacy PolicyandOmniture’s Opt-OutMixpanel’s Privacy PolicyandMixpanel’s Opt-Out\nThe above are examples of our analytics providers and this is not an exhaustive list. We are not responsible for the effectiveness of any other providers’ opt-out mechanisms.\nFlash Local Storage:These cookies are also known as local shared objects and may be used to store your preferences or display content by us, advertisers and other third-parties. Flash cookies need to be deleted in the storage section of your Flash Player Settings Manager.\nInterest-Based Advertising:Most third-party advertisers offer a way to opt out of their interest-based advertising. For more information or to opt out of receiving interest-based advertising from participating third-party advertisers, depending on your country of residence, please visit:\nDigital Advertising Alliance in the USDigital Advertising Alliance of CanadaEuropean Interactive Digital Advertising AllianceAustralian Digital Advertising Alliance\nYou can also opt out of some of the advertising providers we use by visiting their opt-out pages:\nGoogle’s Privacy PolicyandGoogle Analytics Opt-Out PageFacebook Privacy PolicyandFacebook’s Opt-Out PageTwitter Privacy PolicyandTwitter’s Opt-Out PageLiveramp’s Privacy PolicyandLiveramp Opt-Out Page\nThese are examples of our advertising providers and this is not an exhaustive list. In addition, we are not responsible for the effectiveness of any of these providers’ opt-out mechanisms.\nAfter you opt out, you will still see advertisements, but they may not be as relevant to you.\nMobile Settings:You may manage the collection of information for interest-based advertising purposes in mobile apps via the device’s settings, including managing the collection of location data. To opt out of mobile ad tracking from Nielsen or other third parties, you can do so by selecting the “Limit Ad Tracking” (for iOS devices) or “Opt out of Ads Personalization” (for Android devices) options in your device settings.\nConnected Devices:For connected devices, such as smart TVs or streaming devices, you should review the device’s settings and select the option that allows you to disable automatic content recognition or ad tracking.  Typically, to opt out, such devices require you to select options like “limit ad tracking” or to disable options such as “interest-based advertising,” “interactive TV,” or “smart interactivity”.  These settings vary by device type.\nCross-Device Tracking:If you would like to opt out of our browser-based cross-device tracking for advertising purposes, you may do so by using the various methods described above.  You must opt out separately on each device and each browser that you use. For more information about cross-device matching, please visit the Network Advertising Initiative or the Digital Advertising Alliance. If you opt out of cross-device tracking for advertising purposes, we may still conduct cross-device tracking for other purposes, such as analytics.\nConsequences of Deactivation of Cookies: If you disable or remove Cookies, some parts of the Services may not function properly. Information may still be collected and used for other purposes, such as research, online services analytics or internal operations, and to remember your opt-out preferences.\nCONTACT US\nFor inquiries about this Cookies Notice, please contact us atPrivacy@nbcuni.comor Chief Privacy Officer, NBCUniversal Legal Department, 30 Rockefeller Plaza, New York, NY 10112, US.\nFor inquiries from users who reside in the European Economic Area, the United Kingdom or Switzerland, please contact us atPrivacy@nbcuni.comor Privacy, Legal Department, Central Saint Giles, St Giles High Street, London, WC2H 8NU, UK\nCHANGES TO THIS NOTICE\nThis Notice may be revised occasionally and in accordance with legal requirements. Please revisit this Cookie Notice regularly to stay informed about our and our analytic and advertising partners’ use of Cookies.\nThese Cookies are required for Service functionality, including security and fraud prevention, and to enable any purchasing capabilities. You can set your browser to block these Cookies, but some parts of the site may not function properly."
  },
  {
    "title": "Here’s what changed in the new Fed statement",
    "url": "https://www.cnbc.com/2025/06/18/fed-meeting-heres-what-changed-in-the-new-statement.html",
    "date": "2025-06-18",
    "content": "Here’s what changed in the new Fed statement\nSummary:\nPre-Markets\nU.S. Markets\nEurope Markets\nChina Markets\nAsia Markets\nWorld Markets\nCurrencies\nCryptocurrency\nFutures & Commodities\nBonds\nFunds & ETFs\nEconomy\nFinance\nHealth & Science\nMedia\nReal Estate\nEnergy\nClimate\nTransportation\nIndustrials\nRetail\nWealth\nSports\nLife\nSmall Business\nPersonal Finance\nFintech\nFinancial Advisors\nOptions Action\nETF Street\nBuffett Archive\nEarnings\nTrader Talk\nCybersecurity\nAI\nEnterprise\nInternet\nMedia\nMobile\nSocial Media\nCNBC Disruptor 50\nTech Guide\nWhite House\nPolicy\nDefense\nCongress\nExpanding Opportunity\nEurope Politics\nChina Politics\nAsia Politics\nWorld Politics\nLatest Video\nFull Episodes\nLivestream\nTop Video\nLive Audio\nEurope TV\nAsia TV\nCNBC Podcasts\nCEO Interviews\nDigital Originals\nTrust Portfolio\nAnalysis\nTrade Alerts\nMeeting Videos\nHomestretch\nJim’s Columns\nEducation\nSubscribe\nSign In\nPro News\nLivestream\nFull Episodes\nStock Screener\nMarket Forecast\nOptions Investing\nChart Investing\nStock Lists\nSubscribe\nSign In\nMake It\nselect\nUSA\nINTL\nLivestream\nLivestream\nSpaceX’s Starship explodes during routine test in Texas\nSelf-made millionaire who makes $14K/month in passive income: My best advice for a successful side hustle\nTrump meets with national security team on Iran as U.S. prepares to evacuate citizens from Israel\nBank of England holds rates steady, but a summer cut could still be in the cards\nAI avatars in China just proved they are better influencers\nSubscribe to CNBC PRO\nSubscribe to Investing Club\nLicensing & Reprints\nCNBC Councils\nSupply Chain Values\nCNBC on Peacock\nJoin the CNBC Panel\nDigital Products\nNews Releases\nClosed Captioning\nCorrections\nAbout CNBC\nInternships\nSite Map\nAd Choices\nCareers\nHelp\nContact\nNews TipsGot a confidential news tip? We want to hear from you.Get In Touch\nCNBC NewslettersSign up for free newsletters and get more CNBC delivered to your inboxSign Up NowGet this delivered to your inbox, and more info about our products and services.\nAdvertise With UsPlease Contact Us\nPrivacy Policy\nCA Notice\nTerms of Service\nBody:\nThis is a comparison of Wednesday’s Federal Open Market Committee statement with the one issued afterthe Fed’sprevious policymaking meeting in May.\nText removed from the May statement is in red with a horizontal line through the middle.\nText appearing for the first time in the new statement is in red and underlined.\nBlack text appears in both statements.\nWatch Fed Chair Jerome Powell’s press conference here.\nGot a confidential news tip? We want to hear from you.\nSign up for free newsletters and get more CNBC delivered to your inbox\nGet this delivered to your inbox, and more info about our products and services.\n©2025CNBC LLC. All Rights Reserved.A Division of NBCUniversal\nData is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.\nData also provided by\nThis Cookie Notice (“Notice”) explains how NBCUniversal andits affiliates(“NBCUniversal” or “we”), along with our partners, including advertisers and vendors, use cookies and similar tracking technologies when you use our websites, applications, such as games, interactive TV, voice-activated assistants, and other services that link to this policy, as well as connected devices, including those used in our theme parks (“Services”). This Notice provides more information about these technologies, your choices, and is part of the NBCUniversal Privacy Policy availablehere. You should read the Privacy Policy and this Notice for a full picture of NBCUniversal’s use of your information.\nWHAT ARE COOKIES AND HOW ARE THEY USED?\nLike many companies, we use cookies (small text files placed on your computer or device) and other tracking technologies on the Services (referred to together from this point forward as “Cookies”, unless otherwise stated), including HTTP cookies, HTML5 and Flash local storage/flash cookies, web beacons/GIFs, embedded scripts, ETags/cache browsers, and software development kits.\nFirst-party Cookies\nFirst-party Cookies are placed by us (including through the use of third-party service providers) and are used to allow you to use the Services and their features and to assist in analytics activities.\nThird-party Cookies\nCertain third parties may place their Cookies on your device and use them to recognize your device when you visit the Services and when you visit other websites or online services. These third parties collect and use this information pursuant to their own privacy policies. Third-party Cookies enable certain features or functionalities, and advertising, to be provided on the Services.\nTypes of Cookies\nThe Services use the following types of first and third-party Cookies for these purposes:\nStrictly Necessary Cookies:These Cookies are required for Service functionality, including for system administration, security and fraud prevention, and to enable any purchasing capabilities. You can set your browser to block these Cookies, but some parts of the site may not function properly.\nInformation Storage and Access:These Cookies allow us and our partners to store and access information on the device, such as device identifiers.\nMeasurement and Analytics:These Cookies collect data regarding your usage of and performance of the Services, apply market research to generate audiences, and measure the delivery and effectiveness of content and advertising. We and our third-party vendors use these Cookies to perform analytics, so we can improve the content and user experience, develop new products and services, and for statistical purposes. They are also used to recognize you and provide further insights across platforms and devices for the above purposes.\nPersonalization Cookies:These Cookies enable us to provide certain features, such as determining if you are a first-time visitor, capping message frequency, remembering choices you have made (e.g., your language preferences, time zone), and assist you with logging in after registration (including across platforms and devices).  These Cookies also allow your device to receive and send information, so you can see and interact with ads and content.\nContent Selection and Delivery Cookies:Data collected under this category can also be used to select and deliver personalized content, such as news articles and videos.\nAd Selection and Delivery Cookies:These Cookies are used to collect data about your browsing habits, your use of the Services, your preferences, and your interaction with advertisements across platforms and devices for the purpose of delivering interest-based advertising content on the Services and on third-party sites. Third-party sites and services also use interest-based Advertising Cookies to deliver content, including advertisements relevant to your interests on the Services and third-party services. If you reject these Cookies, you may see contextual advertising that may be less relevant to you.\nSocial Media Cookies:These Cookies are set by social media platforms on the Services to enable you to share content with your friends and networks. Social media platforms have the ability to track your online activity outside of the Services. This may impact the content and messages you see on other services you visit.\nWe and third parties may associate Measurement And Analytics Cookies, Personalization Cookies, Content Selection, Delivery Cookies, and Reporting, Ad Selection, Delivery and Reporting Cookies, and Social Media Cookies with other information we have about you.\nCOOKIE MANAGEMENT\nDepending on where you live, you may be able to adjust your Cookie preferences at any time via the “Cookie Settings” link in the footer of relevant websites. You can also use the methods described below to manage Cookies. You must take such steps on each browser or device that you use. If you replace, change or upgrade your browser or device, or delete your cookies, you may need to use these opt-out tools again. As some Cookie-management solutions also rely on Cookies, please adjust your browser Cookie settings carefully, following the relevant instructions below.\nBrowser Controls: You may be able to disable and manage some Cookies through your browser settings. If you use multiple browsers on the same device, you will need to manage your settings for each browser. Please click on any of the below browser links for instructions:\nGoogle ChromeApple SafariMozila FirefoxMicrosoft Internet Explorer\nIf the browser you use is not listed above, please refer to your browser’s help menu for information on how to manage Cookies. Please be aware that disabling cookies will not disable other analytics tools we may use to collect information about you or your use of our Services.\nAnalytics Provider Opt-Outs:To disable analytics Cookies you can use the browser controls discussed above or, for some of our providers, you can use their individual opt-out mechanisms:\nGoogle’s Privacy PolicyandGoogle Analytics Opt-OutOmniture’s Privacy PolicyandOmniture’s Opt-OutMixpanel’s Privacy PolicyandMixpanel’s Opt-Out\nThe above are examples of our analytics providers and this is not an exhaustive list. We are not responsible for the effectiveness of any other providers’ opt-out mechanisms.\nFlash Local Storage:These cookies are also known as local shared objects and may be used to store your preferences or display content by us, advertisers and other third-parties. Flash cookies need to be deleted in the storage section of your Flash Player Settings Manager.\nInterest-Based Advertising:Most third-party advertisers offer a way to opt out of their interest-based advertising. For more information or to opt out of receiving interest-based advertising from participating third-party advertisers, depending on your country of residence, please visit:\nDigital Advertising Alliance in the USDigital Advertising Alliance of CanadaEuropean Interactive Digital Advertising AllianceAustralian Digital Advertising Alliance\nYou can also opt out of some of the advertising providers we use by visiting their opt-out pages:\nGoogle’s Privacy PolicyandGoogle Analytics Opt-Out PageFacebook Privacy PolicyandFacebook’s Opt-Out PageTwitter Privacy PolicyandTwitter’s Opt-Out PageLiveramp’s Privacy PolicyandLiveramp Opt-Out Page\nThese are examples of our advertising providers and this is not an exhaustive list. In addition, we are not responsible for the effectiveness of any of these providers’ opt-out mechanisms.\nAfter you opt out, you will still see advertisements, but they may not be as relevant to you.\nMobile Settings:You may manage the collection of information for interest-based advertising purposes in mobile apps via the device’s settings, including managing the collection of location data. To opt out of mobile ad tracking from Nielsen or other third parties, you can do so by selecting the “Limit Ad Tracking” (for iOS devices) or “Opt out of Ads Personalization” (for Android devices) options in your device settings.\nConnected Devices:For connected devices, such as smart TVs or streaming devices, you should review the device’s settings and select the option that allows you to disable automatic content recognition or ad tracking.  Typically, to opt out, such devices require you to select options like “limit ad tracking” or to disable options such as “interest-based advertising,” “interactive TV,” or “smart interactivity”.  These settings vary by device type.\nCross-Device Tracking:If you would like to opt out of our browser-based cross-device tracking for advertising purposes, you may do so by using the various methods described above.  You must opt out separately on each device and each browser that you use. For more information about cross-device matching, please visit the Network Advertising Initiative or the Digital Advertising Alliance. If you opt out of cross-device tracking for advertising purposes, we may still conduct cross-device tracking for other purposes, such as analytics.\nConsequences of Deactivation of Cookies: If you disable or remove Cookies, some parts of the Services may not function properly. Information may still be collected and used for other purposes, such as research, online services analytics or internal operations, and to remember your opt-out preferences.\nCONTACT US\nFor inquiries about this Cookies Notice, please contact us atPrivacy@nbcuni.comor Chief Privacy Officer, NBCUniversal Legal Department, 30 Rockefeller Plaza, New York, NY 10112, US.\nFor inquiries from users who reside in the European Economic Area, the United Kingdom or Switzerland, please contact us atPrivacy@nbcuni.comor Privacy, Legal Department, Central Saint Giles, St Giles High Street, London, WC2H 8NU, UK\nCHANGES TO THIS NOTICE\nThis Notice may be revised occasionally and in accordance with legal requirements. Please revisit this Cookie Notice regularly to stay informed about our and our analytic and advertising partners’ use of Cookies.\nThese Cookies are required for Service functionality, including security and fraud prevention, and to enable any purchasing capabilities. You can set your browser to block these Cookies, but some parts of the site may not function properly."
  },
  {
    "title": "Fed holds interest rates steady: Here’s what that means for your wallet",
    "url": "https://www.cnbc.com/2025/06/18/fed-holds-interest-rates-steady-what-that-means-for-your-money.html",
    "date": "2025-06-18",
    "content": "Fed holds interest rates steady: Here’s what that means for your wallet\nSummary:\nPre-Markets\nU.S. Markets\nEurope Markets\nChina Markets\nAsia Markets\nWorld Markets\nCurrencies\nCryptocurrency\nFutures & Commodities\nBonds\nFunds & ETFs\nEconomy\nFinance\nHealth & Science\nMedia\nReal Estate\nEnergy\nClimate\nTransportation\nIndustrials\nRetail\nWealth\nSports\nLife\nSmall Business\nPersonal Finance\nFintech\nFinancial Advisors\nOptions Action\nETF Street\nBuffett Archive\nEarnings\nTrader Talk\nCybersecurity\nAI\nEnterprise\nInternet\nMedia\nMobile\nSocial Media\nCNBC Disruptor 50\nTech Guide\nWhite House\nPolicy\nDefense\nCongress\nExpanding Opportunity\nEurope Politics\nChina Politics\nAsia Politics\nWorld Politics\nLatest Video\nFull Episodes\nLivestream\nTop Video\nLive Audio\nEurope TV\nAsia TV\nCNBC Podcasts\nCEO Interviews\nDigital Originals\nTrust Portfolio\nAnalysis\nTrade Alerts\nMeeting Videos\nHomestretch\nJim’s Columns\nEducation\nSubscribe\nSign In\nPro News\nLivestream\nFull Episodes\nStock Screener\nMarket Forecast\nOptions Investing\nChart Investing\nStock Lists\nSubscribe\nSign In\nMake It\nselect\nUSA\nINTL\nLivestream\nLivestream\nThe Federal Reserve kept rates unchanged at the end of its June meeting.\nThe central bank’s interest rate decision has far-reaching implications for almost all types of borrowing and for savings rates.\nFrom credit cards and mortgage rates to auto loans and savings accounts, here’s how the Fed’s moves influence your wallet.\nSubscribe to CNBC PRO\nSubscribe to Investing Club\nLicensing & Reprints\nCNBC Councils\nSupply Chain Values\nCNBC on Peacock\nJoin the CNBC Panel\nDigital Products\nNews Releases\nClosed Captioning\nCorrections\nAbout CNBC\nInternships\nSite Map\nAd Choices\nCareers\nHelp\nContact\nNews TipsGot a confidential news tip? We want to hear from you.Get In Touch\nCNBC NewslettersSign up for free newsletters and get more CNBC delivered to your inboxSign Up NowGet this delivered to your inbox, and more info about our products and services.\nAdvertise With UsPlease Contact Us\nPrivacy Policy\nCA Notice\nTerms of Service\nBody:\nTheFederal Reserveannounced Wednesday it will leaveinterest ratesunchanged.\nThe Fed decisioncame amid demands fromPresident Donald Trumpto lower the key borrowing rate benchmark, andescalating attacksonFed Chair Jerome Powelleven hours before the announcement.\nTrump has been pressuring Powell for a rate cut, arguing that maintaining a fed funds rate that is too high makes it harder for businesses and consumers to access cash, adding more strain to the U.S. economy. But Powell has said that the federal funds rate is likely to stay higher as the economy changes and policy is in flux.\nThat’s enough to keep the central bank on the sidelines, for now, according to Greg McBride, Bankrate’s chief financial analyst. “With the uncertainty around tariffs and how that could impact inflation readings in the month ahead, there’s an ongoing sense of another shoe about to drop,” McBride said.\nMore from Personal Finance:Welcome to the zoo. That’ll be $47 today — ask again tomorrowExperts weigh pros and cons of $1,000 Trump baby bonusHow Trump spending bill may curb low-income tax credit\nThe federal funds rate sets what banks charge each other for overnight lending, but it also has a domino effect on almost all of theborrowing and savings ratesAmericans see every day.\nWhen the Fed hiked rates in 2022 and 2023, the interest rates on most consumer loans — including credit cards, auto loans and home equity lines of credit — quickly followed suit. Even though the central banklowered its benchmark ratethree times in 2024, those consumer rates are still elevated, and are mostly staying high, for now.\n“Borrowing rates are high, with mortgage rates near 7%, many home equity lines of credit in double-digit interest rate territory, and the average credit card rate still above 20%,” McBride said. “But savers continue to be rewarded with inflation-beating returns on the top-yielding savings accounts, money market accounts, and certificates of deposit. Retirees, in particular, are earning good income on their hard-earned savings.”\nManycredit cardshave a variable rate, so there’s a direct connection to the Fed’s benchmark.\nWith a rate cut likely postponeduntil at least September, the average credit card annual percentage rate is currently just over 20%, according to Bankrate — not far from last year’sall-time high. In 2024, banksraisedcredit card interest rates to record levels and some issuers said they arekeeping those higher rates in place.\n“Interest rates on credit cards are painful because they are so high,” said Charlie Wise, senior vice president and head of global research and consulting at TransUnion.\n“The reality is you could drop the fed funds rate by two full basis points and all you are doing is lowering your interest rate from say 22% to 20%,” he said.\nBorrowers are better off switching to a zero-interest balance transfer credit card, or consolidating and paying off high-interest credit cards with a lower-ratepersonal loan, experts say.\nAuto loan ratesare tied to several factors, but the Fed is one of the most significant.\nWith the Fed’s benchmark holding steady, the average rate on a five-year new car loan was 7.3% in May, near a record high, while the average auto loan rate forused carswas 11%, according to Edmunds.\nButcar pricesare also rising — in part due to pressure from Trump’stariffs on imported vehicles— leaving car buyers with bigger monthly payments and a growing affordability problem. Of those households with a monthly car payment, 20% paymore than $1,000 a month, according to separate data from Bank of America.\n“Every way you slice it, car buyers are struggling to find a deal in today’s car market, and financing a new vehicle is becoming cost-prohibitive for more shoppers,” said Ivan Drury, Edmunds’ director of insights.\nMortgage rates don’t directly track the Fed, but are largely tied to Treasury yields and the economy. As a result, concerns overtariffsand ongoing uncertainty about future costs have kept those rates within the same narrow range for months.\nThe average rate for a 30-year, fixed-rate mortgage was 6.91% as of June 17, while the 15-year, fixed-rate was 6.17%, according to Mortgage News Daily.\n“I don’t see any major changes coming in the immediate future, meaning that those shopping for a home this summer should expect rates to remain relatively high,” said Matt Schulz, chief credit analyst at LendingTree.\nAdjustable-rate mortgages, or ARMs, and home equity lines of credit, or HELOCs, are pegged to the prime rate, and those rates are also higher.\nFederal student loan ratesare set once a year, based in part on the last10-year Treasury noteauction in May and fixed for the life of the loan, so most borrowers are somewhat shielded from Fed moves and recent economic turmoil.\nCurrent interest rates on undergraduate federal student loans made through June 30 are 6.53%. Starting July 1, the interest rates will be 6.39%.\nAlthough borrowers with existing federalstudent debtbalances won’t see their rates change, many are now facing otherheadwindsand fewerfederal loan forgivenessoptions.\nWhile the central bank has no direct influence on deposit rates, the yields tend to be correlated to changes in the target federal funds rate.\n“Yields for CDs and high-yield savings accounts aren’t at the sky-high levels they were a year ago, but they’re still really strong,” said LendingTree’s Schulz. Top-yielding onlinesavingsaccounts currently pay more than 4%, on average, according to Bankrate — well above the annual rate of inflation.\n“Shopping around for high-yield savings accounts, if you haven’t done it already, is one of the best financial moves you can make to take advantage of rates being high,” Schulz said.\nSubscribe to CNBC on YouTube.\nGot a confidential news tip? We want to hear from you.\nSign up for free newsletters and get more CNBC delivered to your inbox\nGet this delivered to your inbox, and more info about our products and services.\n©2025CNBC LLC. All Rights Reserved.A Division of NBCUniversal\nData is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.\nData also provided by\nThis Cookie Notice (“Notice”) explains how NBCUniversal andits affiliates(“NBCUniversal” or “we”), along with our partners, including advertisers and vendors, use cookies and similar tracking technologies when you use our websites, applications, such as games, interactive TV, voice-activated assistants, and other services that link to this policy, as well as connected devices, including those used in our theme parks (“Services”). This Notice provides more information about these technologies, your choices, and is part of the NBCUniversal Privacy Policy availablehere. You should read the Privacy Policy and this Notice for a full picture of NBCUniversal’s use of your information.\nWHAT ARE COOKIES AND HOW ARE THEY USED?\nLike many companies, we use cookies (small text files placed on your computer or device) and other tracking technologies on the Services (referred to together from this point forward as “Cookies”, unless otherwise stated), including HTTP cookies, HTML5 and Flash local storage/flash cookies, web beacons/GIFs, embedded scripts, ETags/cache browsers, and software development kits.\nFirst-party Cookies\nFirst-party Cookies are placed by us (including through the use of third-party service providers) and are used to allow you to use the Services and their features and to assist in analytics activities.\nThird-party Cookies\nCertain third parties may place their Cookies on your device and use them to recognize your device when you visit the Services and when you visit other websites or online services. These third parties collect and use this information pursuant to their own privacy policies. Third-party Cookies enable certain features or functionalities, and advertising, to be provided on the Services.\nTypes of Cookies\nThe Services use the following types of first and third-party Cookies for these purposes:\nStrictly Necessary Cookies:These Cookies are required for Service functionality, including for system administration, security and fraud prevention, and to enable any purchasing capabilities. You can set your browser to block these Cookies, but some parts of the site may not function properly.\nInformation Storage and Access:These Cookies allow us and our partners to store and access information on the device, such as device identifiers.\nMeasurement and Analytics:These Cookies collect data regarding your usage of and performance of the Services, apply market research to generate audiences, and measure the delivery and effectiveness of content and advertising. We and our third-party vendors use these Cookies to perform analytics, so we can improve the content and user experience, develop new products and services, and for statistical purposes. They are also used to recognize you and provide further insights across platforms and devices for the above purposes.\nPersonalization Cookies:These Cookies enable us to provide certain features, such as determining if you are a first-time visitor, capping message frequency, remembering choices you have made (e.g., your language preferences, time zone), and assist you with logging in after registration (including across platforms and devices).  These Cookies also allow your device to receive and send information, so you can see and interact with ads and content.\nContent Selection and Delivery Cookies:Data collected under this category can also be used to select and deliver personalized content, such as news articles and videos.\nAd Selection and Delivery Cookies:These Cookies are used to collect data about your browsing habits, your use of the Services, your preferences, and your interaction with advertisements across platforms and devices for the purpose of delivering interest-based advertising content on the Services and on third-party sites. Third-party sites and services also use interest-based Advertising Cookies to deliver content, including advertisements relevant to your interests on the Services and third-party services. If you reject these Cookies, you may see contextual advertising that may be less relevant to you.\nSocial Media Cookies:These Cookies are set by social media platforms on the Services to enable you to share content with your friends and networks. Social media platforms have the ability to track your online activity outside of the Services. This may impact the content and messages you see on other services you visit.\nWe and third parties may associate Measurement And Analytics Cookies, Personalization Cookies, Content Selection, Delivery Cookies, and Reporting, Ad Selection, Delivery and Reporting Cookies, and Social Media Cookies with other information we have about you.\nCOOKIE MANAGEMENT\nDepending on where you live, you may be able to adjust your Cookie preferences at any time via the “Cookie Settings” link in the footer of relevant websites. You can also use the methods described below to manage Cookies. You must take such steps on each browser or device that you use. If you replace, change or upgrade your browser or device, or delete your cookies, you may need to use these opt-out tools again. As some Cookie-management solutions also rely on Cookies, please adjust your browser Cookie settings carefully, following the relevant instructions below.\nBrowser Controls: You may be able to disable and manage some Cookies through your browser settings. If you use multiple browsers on the same device, you will need to manage your settings for each browser. Please click on any of the below browser links for instructions:\nGoogle ChromeApple SafariMozila FirefoxMicrosoft Internet Explorer\nIf the browser you use is not listed above, please refer to your browser’s help menu for information on how to manage Cookies. Please be aware that disabling cookies will not disable other analytics tools we may use to collect information about you or your use of our Services.\nAnalytics Provider Opt-Outs:To disable analytics Cookies you can use the browser controls discussed above or, for some of our providers, you can use their individual opt-out mechanisms:\nGoogle’s Privacy PolicyandGoogle Analytics Opt-OutOmniture’s Privacy PolicyandOmniture’s Opt-OutMixpanel’s Privacy PolicyandMixpanel’s Opt-Out\nThe above are examples of our analytics providers and this is not an exhaustive list. We are not responsible for the effectiveness of any other providers’ opt-out mechanisms.\nFlash Local Storage:These cookies are also known as local shared objects and may be used to store your preferences or display content by us, advertisers and other third-parties. Flash cookies need to be deleted in the storage section of your Flash Player Settings Manager.\nInterest-Based Advertising:Most third-party advertisers offer a way to opt out of their interest-based advertising. For more information or to opt out of receiving interest-based advertising from participating third-party advertisers, depending on your country of residence, please visit:\nDigital Advertising Alliance in the USDigital Advertising Alliance of CanadaEuropean Interactive Digital Advertising AllianceAustralian Digital Advertising Alliance\nYou can also opt out of some of the advertising providers we use by visiting their opt-out pages:\nGoogle’s Privacy PolicyandGoogle Analytics Opt-Out PageFacebook Privacy PolicyandFacebook’s Opt-Out PageTwitter Privacy PolicyandTwitter’s Opt-Out PageLiveramp’s Privacy PolicyandLiveramp Opt-Out Page\nThese are examples of our advertising providers and this is not an exhaustive list. In addition, we are not responsible for the effectiveness of any of these providers’ opt-out mechanisms.\nAfter you opt out, you will still see advertisements, but they may not be as relevant to you.\nMobile Settings:You may manage the collection of information for interest-based advertising purposes in mobile apps via the device’s settings, including managing the collection of location data. To opt out of mobile ad tracking from Nielsen or other third parties, you can do so by selecting the “Limit Ad Tracking” (for iOS devices) or “Opt out of Ads Personalization” (for Android devices) options in your device settings.\nConnected Devices:For connected devices, such as smart TVs or streaming devices, you should review the device’s settings and select the option that allows you to disable automatic content recognition or ad tracking.  Typically, to opt out, such devices require you to select options like “limit ad tracking” or to disable options such as “interest-based advertising,” “interactive TV,” or “smart interactivity”.  These settings vary by device type.\nCross-Device Tracking:If you would like to opt out of our browser-based cross-device tracking for advertising purposes, you may do so by using the various methods described above.  You must opt out separately on each device and each browser that you use. For more information about cross-device matching, please visit the Network Advertising Initiative or the Digital Advertising Alliance. If you opt out of cross-device tracking for advertising purposes, we may still conduct cross-device tracking for other purposes, such as analytics.\nConsequences of Deactivation of Cookies: If you disable or remove Cookies, some parts of the Services may not function properly. Information may still be collected and used for other purposes, such as research, online services analytics or internal operations, and to remember your opt-out preferences.\nCONTACT US\nFor inquiries about this Cookies Notice, please contact us atPrivacy@nbcuni.comor Chief Privacy Officer, NBCUniversal Legal Department, 30 Rockefeller Plaza, New York, NY 10112, US.\nFor inquiries from users who reside in the European Economic Area, the United Kingdom or Switzerland, please contact us atPrivacy@nbcuni.comor Privacy, Legal Department, Central Saint Giles, St Giles High Street, London, WC2H 8NU, UK\nCHANGES TO THIS NOTICE\nThis Notice may be revised occasionally and in accordance with legal requirements. Please revisit this Cookie Notice regularly to stay informed about our and our analytic and advertising partners’ use of Cookies.\nThese Cookies are required for Service functionality, including security and fraud prevention, and to enable any purchasing capabilities. You can set your browser to block these Cookies, but some parts of the site may not function properly."
  },
  {
    "title": "Fed holds key rate steady, still sees two more cuts this year",
    "url": "https://www.cnbc.com/2025/06/18/fed-rate-decision-june-2025-.html",
    "date": "2025-06-18",
    "content": "Fed holds key rate steady, still sees two more cuts this year\nSummary:\nPre-Markets\nU.S. Markets\nEurope Markets\nChina Markets\nAsia Markets\nWorld Markets\nCurrencies\nCryptocurrency\nFutures & Commodities\nBonds\nFunds & ETFs\nEconomy\nFinance\nHealth & Science\nMedia\nReal Estate\nEnergy\nClimate\nTransportation\nIndustrials\nRetail\nWealth\nSports\nLife\nSmall Business\nPersonal Finance\nFintech\nFinancial Advisors\nOptions Action\nETF Street\nBuffett Archive\nEarnings\nTrader Talk\nCybersecurity\nAI\nEnterprise\nInternet\nMedia\nMobile\nSocial Media\nCNBC Disruptor 50\nTech Guide\nWhite House\nPolicy\nDefense\nCongress\nExpanding Opportunity\nEurope Politics\nChina Politics\nAsia Politics\nWorld Politics\nLatest Video\nFull Episodes\nLivestream\nTop Video\nLive Audio\nEurope TV\nAsia TV\nCNBC Podcasts\nCEO Interviews\nDigital Originals\nTrust Portfolio\nAnalysis\nTrade Alerts\nMeeting Videos\nHomestretch\nJim’s Columns\nEducation\nSubscribe\nSign In\nPro News\nLivestream\nFull Episodes\nStock Screener\nMarket Forecast\nOptions Investing\nChart Investing\nStock Lists\nSubscribe\nSign In\nMake It\nselect\nUSA\nINTL\nLivestream\nLivestream\nThe Federal Reserve kept its key borrowing rate targeted in a range between 4.25%-4.5%, where it has been since December.\nHowever, the central bank expects inflation to remain elevated and sees lower economic growth ahead.\nStill, the Federal Open Market Committee expects to make two rate reductions later this year, according to the closely watched “dot plot.”\nGoldman says ‘TINA trade’ is alive and well, fueled by 401(k) buying\nBest stocks: Defense, including these 2 names, may be in secular bull market as global conflicts mount\nWhat Amazon and Walmart’s reported stablecoin exploration means for payments stocks\nGoldman Sachs says buy these five stocks that are set to rally\nSubscribe to CNBC PRO\nSubscribe to Investing Club\nLicensing & Reprints\nCNBC Councils\nSupply Chain Values\nCNBC on Peacock\nJoin the CNBC Panel\nDigital Products\nNews Releases\nClosed Captioning\nCorrections\nAbout CNBC\nInternships\nSite Map\nAd Choices\nCareers\nHelp\nContact\nNews TipsGot a confidential news tip? We want to hear from you.Get In Touch\nCNBC NewslettersSign up for free newsletters and get more CNBC delivered to your inboxSign Up NowGet this delivered to your inbox, and more info about our products and services.\nAdvertise With UsPlease Contact Us\nPrivacy Policy\nCA Notice\nTerms of Service\nBody:\nWASHINGTON – The Federal Reserve on Wednesday kept interest rates steady amid expectations of higher inflation and lower economic growth ahead, and still pointed to two reductions later this year.\nWith markets expecting no chance of a central bank move this week, the Federal Open Market Committee kept its key borrowing rate targeted in a range between 4.25%-4.5%, where it has been since December.\nAlong with the rate decision, the committee indicated, through its closely watched “dot plot,” that two cuts by the end of 2025 are still on the table. However, it lopped off one reduction for both 2026 and 2027, putting the expected future rate cuts at four, or a full percentage point.\nThe plot indicated continued uncertainty from Fed officials about the future of rates. Each dot represents one official’s expectations for rates. There was a wide dispersion on the matrix, with an outlook pointing to a fed funds rate around 3.4% in 2027.\nSeven of the 19 participants indicated they wanted no cuts this year, up from four in March. However, the committee approved the policy statement unanimously.\nEconomic projections from meeting participants pointed to further stagflationary pressures, with participants seeing the gross domestic product advancing at a 1.4% pace in 2025 and inflation hitting 3%.\nThe revised forecasts from the last update in March represented a decrease of 0.3 percentage point for GDP and an increase of the same amount for the personal consumption expenditures price index. Core PCE, which eliminates food and energy prices, was projected at 3.1%, also 0.3 percentage point higher. The unemployment outlook saw a small revision, up to 4.5%, or 0.1 percentage point higher than March and 0.3 percentage point above the current level.\nThe FOMC statement changed little from the May meeting. Broadly speaking, the economy grew at a “solid pace,” with “low” unemployment and “somewhat elevated” inflation, the committee said.\nMoreover, the committee indicated less concern about the gyrations of the economy and the clouds over White House trade policy.\n“Uncertainty about the economic outlook has diminished but remains elevated. The Committee is attentive to the risks to both sides of its dual mandate,” the committee said.\nDuringa news conference, Federal Reserve ChairmanJerome Powellsuggested there is time to wait for more clarity.\n“For the time being, we are well positioned to wait to learn more about the likely course of the economy before considering any adjustments to our policies,” Powell said.\nU.S. stockswere wavering near flatline in the wake of the announcement.\nWhilethe Fed’s statementdid not elaborate on why uncertainty has ebbed, PresidentDonald Trumphas eased some of his fiery trade rhetoric and the White House is in the midst of a 90-day negotiating period over tariffs.\nTrump’s rhetoric toward the Fed, however, has not softened.\nEarlier Wednesday, the president again slammed Powell and his colleagues for not easing. Trump said the fed funds rate should be at least 2 percentage points lower andderided Powell as “stupid”for not pushing the committee to cut.\nFed officials have been reluctant to move, fearful that tariffs Trump implemented this year could causeinflation in the coming months. Price gauges so far have not indicated that the duties are having much of an impact. A delay in feed-through of the tariffs along with softening consumer demand and a buildup of inventories ahead of the April 2 “liberation day” announcement havehelped deflect their impact.\n“Everyone that I know is forecasting a meaningful increase in inflation in coming months from tariffs because someone has to pay for the tariffs,” Powell said.\nTheconflict between Israel and Iranadds another wild card to the policy mix, withprospects of higher energy pricesa potential additional factor in keeping the Fed from cutting. The statement did not mention influence from the Middle East fighting.\nA gradually softening economy could provide incentive to cut later this year.\nRecent labor market data shows layoffs creeping higher, long-term unemployment also rising and consumers spending less.Retail sales tumbled nearly 1% in Mayand recent data has reflected a cooling housing market, with starts hitting their lowest level in five years.\n“Effectively they are sitting on their hands, waiting to see if tariffs increase inflation or the jobs market starts to falter, and whichever part of their dual mandate is impacted first will likely guide whichever direction they take, although the bias is still toward cutting rates (or at least keeping rates unchanged; not raising rates),” said Chris Zaccarelli, chief investment officer at Northlight Asset Management.\nZaccarelli wasn’t surprised that rates held steady. However, he said the market was surprised by the comment that uncertainty had “diminished.”\nFor Trump, though, the importance of lower rates stems from the high cost the government is paying to finance its $36 trillion debt.\nInterest on the debt is on track to total $1.2 trillion this year and exceeds all other budget items except Social Security and Medicare. The Fed last cut in December, and Treasury yields have held higher throughout the year, putting additional pressure ona budget deficitlikely to approach $2 trillion, or more than 6% of GDP.\nCorrection: The meeting participants expect gross domestic product to advance at a 1.4% pace in 2025. An earlier version of the story misstated the year.\nGot a confidential news tip? We want to hear from you.\nSign up for free newsletters and get more CNBC delivered to your inbox\nGet this delivered to your inbox, and more info about our products and services.\n©2025CNBC LLC. All Rights Reserved.A Division of NBCUniversal\nData is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.\nData also provided by\nThis Cookie Notice (“Notice”) explains how NBCUniversal andits affiliates(“NBCUniversal” or “we”), along with our partners, including advertisers and vendors, use cookies and similar tracking technologies when you use our websites, applications, such as games, interactive TV, voice-activated assistants, and other services that link to this policy, as well as connected devices, including those used in our theme parks (“Services”). This Notice provides more information about these technologies, your choices, and is part of the NBCUniversal Privacy Policy availablehere. You should read the Privacy Policy and this Notice for a full picture of NBCUniversal’s use of your information.\nWHAT ARE COOKIES AND HOW ARE THEY USED?\nLike many companies, we use cookies (small text files placed on your computer or device) and other tracking technologies on the Services (referred to together from this point forward as “Cookies”, unless otherwise stated), including HTTP cookies, HTML5 and Flash local storage/flash cookies, web beacons/GIFs, embedded scripts, ETags/cache browsers, and software development kits.\nFirst-party Cookies\nFirst-party Cookies are placed by us (including through the use of third-party service providers) and are used to allow you to use the Services and their features and to assist in analytics activities.\nThird-party Cookies\nCertain third parties may place their Cookies on your device and use them to recognize your device when you visit the Services and when you visit other websites or online services. These third parties collect and use this information pursuant to their own privacy policies. Third-party Cookies enable certain features or functionalities, and advertising, to be provided on the Services.\nTypes of Cookies\nThe Services use the following types of first and third-party Cookies for these purposes:\nStrictly Necessary Cookies:These Cookies are required for Service functionality, including for system administration, security and fraud prevention, and to enable any purchasing capabilities. You can set your browser to block these Cookies, but some parts of the site may not function properly.\nInformation Storage and Access:These Cookies allow us and our partners to store and access information on the device, such as device identifiers.\nMeasurement and Analytics:These Cookies collect data regarding your usage of and performance of the Services, apply market research to generate audiences, and measure the delivery and effectiveness of content and advertising. We and our third-party vendors use these Cookies to perform analytics, so we can improve the content and user experience, develop new products and services, and for statistical purposes. They are also used to recognize you and provide further insights across platforms and devices for the above purposes.\nPersonalization Cookies:These Cookies enable us to provide certain features, such as determining if you are a first-time visitor, capping message frequency, remembering choices you have made (e.g., your language preferences, time zone), and assist you with logging in after registration (including across platforms and devices).  These Cookies also allow your device to receive and send information, so you can see and interact with ads and content.\nContent Selection and Delivery Cookies:Data collected under this category can also be used to select and deliver personalized content, such as news articles and videos.\nAd Selection and Delivery Cookies:These Cookies are used to collect data about your browsing habits, your use of the Services, your preferences, and your interaction with advertisements across platforms and devices for the purpose of delivering interest-based advertising content on the Services and on third-party sites. Third-party sites and services also use interest-based Advertising Cookies to deliver content, including advertisements relevant to your interests on the Services and third-party services. If you reject these Cookies, you may see contextual advertising that may be less relevant to you.\nSocial Media Cookies:These Cookies are set by social media platforms on the Services to enable you to share content with your friends and networks. Social media platforms have the ability to track your online activity outside of the Services. This may impact the content and messages you see on other services you visit.\nWe and third parties may associate Measurement And Analytics Cookies, Personalization Cookies, Content Selection, Delivery Cookies, and Reporting, Ad Selection, Delivery and Reporting Cookies, and Social Media Cookies with other information we have about you.\nCOOKIE MANAGEMENT\nDepending on where you live, you may be able to adjust your Cookie preferences at any time via the “Cookie Settings” link in the footer of relevant websites. You can also use the methods described below to manage Cookies. You must take such steps on each browser or device that you use. If you replace, change or upgrade your browser or device, or delete your cookies, you may need to use these opt-out tools again. As some Cookie-management solutions also rely on Cookies, please adjust your browser Cookie settings carefully, following the relevant instructions below.\nBrowser Controls: You may be able to disable and manage some Cookies through your browser settings. If you use multiple browsers on the same device, you will need to manage your settings for each browser. Please click on any of the below browser links for instructions:\nGoogle ChromeApple SafariMozila FirefoxMicrosoft Internet Explorer\nIf the browser you use is not listed above, please refer to your browser’s help menu for information on how to manage Cookies. Please be aware that disabling cookies will not disable other analytics tools we may use to collect information about you or your use of our Services.\nAnalytics Provider Opt-Outs:To disable analytics Cookies you can use the browser controls discussed above or, for some of our providers, you can use their individual opt-out mechanisms:\nGoogle’s Privacy PolicyandGoogle Analytics Opt-OutOmniture’s Privacy PolicyandOmniture’s Opt-OutMixpanel’s Privacy PolicyandMixpanel’s Opt-Out\nThe above are examples of our analytics providers and this is not an exhaustive list. We are not responsible for the effectiveness of any other providers’ opt-out mechanisms.\nFlash Local Storage:These cookies are also known as local shared objects and may be used to store your preferences or display content by us, advertisers and other third-parties. Flash cookies need to be deleted in the storage section of your Flash Player Settings Manager.\nInterest-Based Advertising:Most third-party advertisers offer a way to opt out of their interest-based advertising. For more information or to opt out of receiving interest-based advertising from participating third-party advertisers, depending on your country of residence, please visit:\nDigital Advertising Alliance in the USDigital Advertising Alliance of CanadaEuropean Interactive Digital Advertising AllianceAustralian Digital Advertising Alliance\nYou can also opt out of some of the advertising providers we use by visiting their opt-out pages:\nGoogle’s Privacy PolicyandGoogle Analytics Opt-Out PageFacebook Privacy PolicyandFacebook’s Opt-Out PageTwitter Privacy PolicyandTwitter’s Opt-Out PageLiveramp’s Privacy PolicyandLiveramp Opt-Out Page\nThese are examples of our advertising providers and this is not an exhaustive list. In addition, we are not responsible for the effectiveness of any of these providers’ opt-out mechanisms.\nAfter you opt out, you will still see advertisements, but they may not be as relevant to you.\nMobile Settings:You may manage the collection of information for interest-based advertising purposes in mobile apps via the device’s settings, including managing the collection of location data. To opt out of mobile ad tracking from Nielsen or other third parties, you can do so by selecting the “Limit Ad Tracking” (for iOS devices) or “Opt out of Ads Personalization” (for Android devices) options in your device settings.\nConnected Devices:For connected devices, such as smart TVs or streaming devices, you should review the device’s settings and select the option that allows you to disable automatic content recognition or ad tracking.  Typically, to opt out, such devices require you to select options like “limit ad tracking” or to disable options such as “interest-based advertising,” “interactive TV,” or “smart interactivity”.  These settings vary by device type.\nCross-Device Tracking:If you would like to opt out of our browser-based cross-device tracking for advertising purposes, you may do so by using the various methods described above.  You must opt out separately on each device and each browser that you use. For more information about cross-device matching, please visit the Network Advertising Initiative or the Digital Advertising Alliance. If you opt out of cross-device tracking for advertising purposes, we may still conduct cross-device tracking for other purposes, such as analytics.\nConsequences of Deactivation of Cookies: If you disable or remove Cookies, some parts of the Services may not function properly. Information may still be collected and used for other purposes, such as research, online services analytics or internal operations, and to remember your opt-out preferences.\nCONTACT US\nFor inquiries about this Cookies Notice, please contact us atPrivacy@nbcuni.comor Chief Privacy Officer, NBCUniversal Legal Department, 30 Rockefeller Plaza, New York, NY 10112, US.\nFor inquiries from users who reside in the European Economic Area, the United Kingdom or Switzerland, please contact us atPrivacy@nbcuni.comor Privacy, Legal Department, Central Saint Giles, St Giles High Street, London, WC2H 8NU, UK\nCHANGES TO THIS NOTICE\nThis Notice may be revised occasionally and in accordance with legal requirements. Please revisit this Cookie Notice regularly to stay informed about our and our analytic and advertising partners’ use of Cookies.\nThese Cookies are required for Service functionality, including security and fraud prevention, and to enable any purchasing capabilities. You can set your browser to block these Cookies, but some parts of the site may not function properly."
  },
  {
    "title": "Trump says ‘stupid’ Powell ‘probably won’t cut’ rates when Fed meeting ends Wednesday",
    "url": "https://www.cnbc.com/2025/06/18/trump-says-stupid-powell-probably-wont-cut-rates-when-fed-meeting-ends-wednesday.html",
    "date": "2025-06-18",
    "content": "Trump says ‘stupid’ Powell ‘probably won’t cut’ rates when Fed meeting ends Wednesday\nSummary:\nPre-Markets\nU.S. Markets\nEurope Markets\nChina Markets\nAsia Markets\nWorld Markets\nCurrencies\nCryptocurrency\nFutures & Commodities\nBonds\nFunds & ETFs\nEconomy\nFinance\nHealth & Science\nMedia\nReal Estate\nEnergy\nClimate\nTransportation\nIndustrials\nRetail\nWealth\nSports\nLife\nSmall Business\nPersonal Finance\nFintech\nFinancial Advisors\nOptions Action\nETF Street\nBuffett Archive\nEarnings\nTrader Talk\nCybersecurity\nAI\nEnterprise\nInternet\nMedia\nMobile\nSocial Media\nCNBC Disruptor 50\nTech Guide\nWhite House\nPolicy\nDefense\nCongress\nExpanding Opportunity\nEurope Politics\nChina Politics\nAsia Politics\nWorld Politics\nLatest Video\nFull Episodes\nLivestream\nTop Video\nLive Audio\nEurope TV\nAsia TV\nCNBC Podcasts\nCEO Interviews\nDigital Originals\nTrust Portfolio\nAnalysis\nTrade Alerts\nMeeting Videos\nHomestretch\nJim’s Columns\nEducation\nSubscribe\nSign In\nPro News\nLivestream\nFull Episodes\nStock Screener\nMarket Forecast\nOptions Investing\nChart Investing\nStock Lists\nSubscribe\nSign In\nMake It\nselect\nUSA\nINTL\nLivestream\nLivestream\nGoldman says ‘TINA trade’ is alive and well, fueled by 401(k) buying\nBest stocks: Defense, including these 2 names, may be in secular bull market as global conflicts mount\nWhat Amazon and Walmart’s reported stablecoin exploration means for payments stocks\nGoldman Sachs says buy these five stocks that are set to rally\nSubscribe to CNBC PRO\nSubscribe to Investing Club\nLicensing & Reprints\nCNBC Councils\nSupply Chain Values\nCNBC on Peacock\nJoin the CNBC Panel\nDigital Products\nNews Releases\nClosed Captioning\nCorrections\nAbout CNBC\nInternships\nSite Map\nAd Choices\nCareers\nHelp\nContact\nNews TipsGot a confidential news tip? We want to hear from you.Get In Touch\nCNBC NewslettersSign up for free newsletters and get more CNBC delivered to your inboxSign Up NowGet this delivered to your inbox, and more info about our products and services.\nAdvertise With UsPlease Contact Us\nPrivacy Policy\nCA Notice\nTerms of Service\nBody:\nWith the Federal Reserve just hours away from its latest decision on interest rates, PresidentDonald Trumpon Wednesday lambasted ChairJerome Powell, calling him “stupid” while doubting the central bank would cut.\nIn his latest in a series of attacks on Powell that go back years, Trump said the Fed’s key borrowing rate should be at least 2 percentage points lower.\n“So we have a stupid person. Frankly, you probably won’t cut today,” Trump said in impromptu remarks just outside the White House. “Europe had 10 cuts, and we had none. And I guess he’s a political guy, I don’t know. He’s a political guy who’s not a smart person, but he’s costing the country a fortune.”\nThe remarks came just about four hours before the rate-setting Federal Open Market Committee was to release its statement on interest rates, along with an update of where it sees policy and several key economic measures heading over the next several years.\nMarket pricing indicates no probability of a cut at this meeting, with the next move expected in September. The Fed currently targets its overnight borrowing rate in a range between 4.25%-4.50%.\nPowell and his colleagues have expressed hesitation about adjusting rates with so many unanswered questions regarding the economy.\nFor one, the longer-term impact of Trump’s tariffs is not known. Inflation indicators are little changed since the tariffs were implemented in April, but various factors have colluded to blunt the impact.\nTrump, though, said higher interest rates are costing the U.S. “hundreds of billions” of dollars in financing costs that could be saved if the Fed would ease.\n“If he’s worried about inflation, that’s OK. I understand that. I don’t think there’s going to be any. So far there hasn’t,” Trump said.\n“But now we have a man that just refuses to lower the Fed rate, just refuses to do and he’s not a smart person,” the president added. “I don’t even think he’s that political. I think he hates me, but that’s OK.”\nTrump and Powell recently met at the White House, though little has been disclosed about what was discussed. Powell and his colleagues have vowed they will not be swayed by political pressure, which has ramped up to include other administration officials, such as Vice President JD Vance.\nTrump even mused about appointing himself as Fed chair, saying, “I’d do a much better job than these people.”\nPowell’s term expires in May 2026, and Trump has said he intends to name a successor soon.\nGot a confidential news tip? We want to hear from you.\nSign up for free newsletters and get more CNBC delivered to your inbox\nGet this delivered to your inbox, and more info about our products and services.\n©2025CNBC LLC. All Rights Reserved.A Division of NBCUniversal\nData is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.\nData also provided by\nThis Cookie Notice (“Notice”) explains how NBCUniversal andits affiliates(“NBCUniversal” or “we”), along with our partners, including advertisers and vendors, use cookies and similar tracking technologies when you use our websites, applications, such as games, interactive TV, voice-activated assistants, and other services that link to this policy, as well as connected devices, including those used in our theme parks (“Services”). This Notice provides more information about these technologies, your choices, and is part of the NBCUniversal Privacy Policy availablehere. You should read the Privacy Policy and this Notice for a full picture of NBCUniversal’s use of your information.\nWHAT ARE COOKIES AND HOW ARE THEY USED?\nLike many companies, we use cookies (small text files placed on your computer or device) and other tracking technologies on the Services (referred to together from this point forward as “Cookies”, unless otherwise stated), including HTTP cookies, HTML5 and Flash local storage/flash cookies, web beacons/GIFs, embedded scripts, ETags/cache browsers, and software development kits.\nFirst-party Cookies\nFirst-party Cookies are placed by us (including through the use of third-party service providers) and are used to allow you to use the Services and their features and to assist in analytics activities.\nThird-party Cookies\nCertain third parties may place their Cookies on your device and use them to recognize your device when you visit the Services and when you visit other websites or online services. These third parties collect and use this information pursuant to their own privacy policies. Third-party Cookies enable certain features or functionalities, and advertising, to be provided on the Services.\nTypes of Cookies\nThe Services use the following types of first and third-party Cookies for these purposes:\nStrictly Necessary Cookies:These Cookies are required for Service functionality, including for system administration, security and fraud prevention, and to enable any purchasing capabilities. You can set your browser to block these Cookies, but some parts of the site may not function properly.\nInformation Storage and Access:These Cookies allow us and our partners to store and access information on the device, such as device identifiers.\nMeasurement and Analytics:These Cookies collect data regarding your usage of and performance of the Services, apply market research to generate audiences, and measure the delivery and effectiveness of content and advertising. We and our third-party vendors use these Cookies to perform analytics, so we can improve the content and user experience, develop new products and services, and for statistical purposes. They are also used to recognize you and provide further insights across platforms and devices for the above purposes.\nPersonalization Cookies:These Cookies enable us to provide certain features, such as determining if you are a first-time visitor, capping message frequency, remembering choices you have made (e.g., your language preferences, time zone), and assist you with logging in after registration (including across platforms and devices).  These Cookies also allow your device to receive and send information, so you can see and interact with ads and content.\nContent Selection and Delivery Cookies:Data collected under this category can also be used to select and deliver personalized content, such as news articles and videos.\nAd Selection and Delivery Cookies:These Cookies are used to collect data about your browsing habits, your use of the Services, your preferences, and your interaction with advertisements across platforms and devices for the purpose of delivering interest-based advertising content on the Services and on third-party sites. Third-party sites and services also use interest-based Advertising Cookies to deliver content, including advertisements relevant to your interests on the Services and third-party services. If you reject these Cookies, you may see contextual advertising that may be less relevant to you.\nSocial Media Cookies:These Cookies are set by social media platforms on the Services to enable you to share content with your friends and networks. Social media platforms have the ability to track your online activity outside of the Services. This may impact the content and messages you see on other services you visit.\nWe and third parties may associate Measurement And Analytics Cookies, Personalization Cookies, Content Selection, Delivery Cookies, and Reporting, Ad Selection, Delivery and Reporting Cookies, and Social Media Cookies with other information we have about you.\nCOOKIE MANAGEMENT\nDepending on where you live, you may be able to adjust your Cookie preferences at any time via the “Cookie Settings” link in the footer of relevant websites. You can also use the methods described below to manage Cookies. You must take such steps on each browser or device that you use. If you replace, change or upgrade your browser or device, or delete your cookies, you may need to use these opt-out tools again. As some Cookie-management solutions also rely on Cookies, please adjust your browser Cookie settings carefully, following the relevant instructions below.\nBrowser Controls: You may be able to disable and manage some Cookies through your browser settings. If you use multiple browsers on the same device, you will need to manage your settings for each browser. Please click on any of the below browser links for instructions:\nGoogle ChromeApple SafariMozila FirefoxMicrosoft Internet Explorer\nIf the browser you use is not listed above, please refer to your browser’s help menu for information on how to manage Cookies. Please be aware that disabling cookies will not disable other analytics tools we may use to collect information about you or your use of our Services.\nAnalytics Provider Opt-Outs:To disable analytics Cookies you can use the browser controls discussed above or, for some of our providers, you can use their individual opt-out mechanisms:\nGoogle’s Privacy PolicyandGoogle Analytics Opt-OutOmniture’s Privacy PolicyandOmniture’s Opt-OutMixpanel’s Privacy PolicyandMixpanel’s Opt-Out\nThe above are examples of our analytics providers and this is not an exhaustive list. We are not responsible for the effectiveness of any other providers’ opt-out mechanisms.\nFlash Local Storage:These cookies are also known as local shared objects and may be used to store your preferences or display content by us, advertisers and other third-parties. Flash cookies need to be deleted in the storage section of your Flash Player Settings Manager.\nInterest-Based Advertising:Most third-party advertisers offer a way to opt out of their interest-based advertising. For more information or to opt out of receiving interest-based advertising from participating third-party advertisers, depending on your country of residence, please visit:\nDigital Advertising Alliance in the USDigital Advertising Alliance of CanadaEuropean Interactive Digital Advertising AllianceAustralian Digital Advertising Alliance\nYou can also opt out of some of the advertising providers we use by visiting their opt-out pages:\nGoogle’s Privacy PolicyandGoogle Analytics Opt-Out PageFacebook Privacy PolicyandFacebook’s Opt-Out PageTwitter Privacy PolicyandTwitter’s Opt-Out PageLiveramp’s Privacy PolicyandLiveramp Opt-Out Page\nThese are examples of our advertising providers and this is not an exhaustive list. In addition, we are not responsible for the effectiveness of any of these providers’ opt-out mechanisms.\nAfter you opt out, you will still see advertisements, but they may not be as relevant to you.\nMobile Settings:You may manage the collection of information for interest-based advertising purposes in mobile apps via the device’s settings, including managing the collection of location data. To opt out of mobile ad tracking from Nielsen or other third parties, you can do so by selecting the “Limit Ad Tracking” (for iOS devices) or “Opt out of Ads Personalization” (for Android devices) options in your device settings.\nConnected Devices:For connected devices, such as smart TVs or streaming devices, you should review the device’s settings and select the option that allows you to disable automatic content recognition or ad tracking.  Typically, to opt out, such devices require you to select options like “limit ad tracking” or to disable options such as “interest-based advertising,” “interactive TV,” or “smart interactivity”.  These settings vary by device type.\nCross-Device Tracking:If you would like to opt out of our browser-based cross-device tracking for advertising purposes, you may do so by using the various methods described above.  You must opt out separately on each device and each browser that you use. For more information about cross-device matching, please visit the Network Advertising Initiative or the Digital Advertising Alliance. If you opt out of cross-device tracking for advertising purposes, we may still conduct cross-device tracking for other purposes, such as analytics.\nConsequences of Deactivation of Cookies: If you disable or remove Cookies, some parts of the Services may not function properly. Information may still be collected and used for other purposes, such as research, online services analytics or internal operations, and to remember your opt-out preferences.\nCONTACT US\nFor inquiries about this Cookies Notice, please contact us atPrivacy@nbcuni.comor Chief Privacy Officer, NBCUniversal Legal Department, 30 Rockefeller Plaza, New York, NY 10112, US.\nFor inquiries from users who reside in the European Economic Area, the United Kingdom or Switzerland, please contact us atPrivacy@nbcuni.comor Privacy, Legal Department, Central Saint Giles, St Giles High Street, London, WC2H 8NU, UK\nCHANGES TO THIS NOTICE\nThis Notice may be revised occasionally and in accordance with legal requirements. Please revisit this Cookie Notice regularly to stay informed about our and our analytic and advertising partners’ use of Cookies.\nThese Cookies are required for Service functionality, including security and fraud prevention, and to enable any purchasing capabilities. You can set your browser to block these Cookies, but some parts of the site may not function properly."
  },
  {
    "title": "Is the U.S. consumer OK? Fed chief Powell will soon be the latest to weigh in",
    "url": "https://www.cnbc.com/2025/06/18/is-the-us-consumer-ok-fed-chief-powell-will-soon-be-the-latest-to-weigh-in.html",
    "date": "2025-06-18",
    "content": "Is the U.S. consumer OK? Fed chief Powell will soon be the latest to weigh in\nSummary:\nPre-Markets\nU.S. Markets\nEurope Markets\nChina Markets\nAsia Markets\nWorld Markets\nCurrencies\nCryptocurrency\nFutures & Commodities\nBonds\nFunds & ETFs\nEconomy\nFinance\nHealth & Science\nMedia\nReal Estate\nEnergy\nClimate\nTransportation\nIndustrials\nRetail\nWealth\nSports\nLife\nSmall Business\nPersonal Finance\nFintech\nFinancial Advisors\nOptions Action\nETF Street\nBuffett Archive\nEarnings\nTrader Talk\nCybersecurity\nAI\nEnterprise\nInternet\nMedia\nMobile\nSocial Media\nCNBC Disruptor 50\nTech Guide\nWhite House\nPolicy\nDefense\nCongress\nExpanding Opportunity\nEurope Politics\nChina Politics\nAsia Politics\nWorld Politics\nLatest Video\nFull Episodes\nLivestream\nTop Video\nLive Audio\nEurope TV\nAsia TV\nCNBC Podcasts\nCEO Interviews\nDigital Originals\nTrust Portfolio\nAnalysis\nTrade Alerts\nMeeting Videos\nHomestretch\nJim’s Columns\nEducation\nSubscribe\nSign In\nPro News\nLivestream\nFull Episodes\nStock Screener\nMarket Forecast\nOptions Investing\nChart Investing\nStock Lists\nSubscribe\nSign In\nMake It\nselect\nUSA\nINTL\nLivestream\nLivestream\nThe secret AI sauce behind Meta stock’s 683% rise since the dark days of 2022\nThe Fed’s outlook for inflation and jobs shows the bind it’s in — plus, Amazon’s robotaxi move\nAre cybersecurity stocks a new safety trade? What the Israel-Iran conflict shows\nEli Lilly looks beyond its blockbuster obesity drugs with another smart deal\nSubscribe to CNBC PRO\nSubscribe to Investing Club\nLicensing & Reprints\nCNBC Councils\nSupply Chain Values\nCNBC on Peacock\nJoin the CNBC Panel\nDigital Products\nNews Releases\nClosed Captioning\nCorrections\nAbout CNBC\nInternships\nSite Map\nAd Choices\nCareers\nHelp\nContact\nNews TipsGot a confidential news tip? We want to hear from you.Get In Touch\nCNBC NewslettersSign up for free newsletters and get more CNBC delivered to your inboxSign Up NowGet this delivered to your inbox, and more info about our products and services.\nAdvertise With UsPlease Contact Us\nPrivacy Policy\nCA Notice\nTerms of Service\nBody:\nIs the American consumer still all right? Several signals this week are flashing yellow, upping the ante as investors’ attention turns to the Federal Reserve meeting on Wednesday.\nGot a confidential news tip? We want to hear from you.\nSign up for free newsletters and get more CNBC delivered to your inbox\nGet this delivered to your inbox, and more info about our products and services.\n©2025CNBC LLC. All Rights Reserved.A Division of NBCUniversal\nData is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.\nData also provided by\nThis Cookie Notice (“Notice”) explains how NBCUniversal andits affiliates(“NBCUniversal” or “we”), along with our partners, including advertisers and vendors, use cookies and similar tracking technologies when you use our websites, applications, such as games, interactive TV, voice-activated assistants, and other services that link to this policy, as well as connected devices, including those used in our theme parks (“Services”). This Notice provides more information about these technologies, your choices, and is part of the NBCUniversal Privacy Policy availablehere. You should read the Privacy Policy and this Notice for a full picture of NBCUniversal’s use of your information.\nWHAT ARE COOKIES AND HOW ARE THEY USED?\nLike many companies, we use cookies (small text files placed on your computer or device) and other tracking technologies on the Services (referred to together from this point forward as “Cookies”, unless otherwise stated), including HTTP cookies, HTML5 and Flash local storage/flash cookies, web beacons/GIFs, embedded scripts, ETags/cache browsers, and software development kits.\nFirst-party Cookies\nFirst-party Cookies are placed by us (including through the use of third-party service providers) and are used to allow you to use the Services and their features and to assist in analytics activities.\nThird-party Cookies\nCertain third parties may place their Cookies on your device and use them to recognize your device when you visit the Services and when you visit other websites or online services. These third parties collect and use this information pursuant to their own privacy policies. Third-party Cookies enable certain features or functionalities, and advertising, to be provided on the Services.\nTypes of Cookies\nThe Services use the following types of first and third-party Cookies for these purposes:\nStrictly Necessary Cookies:These Cookies are required for Service functionality, including for system administration, security and fraud prevention, and to enable any purchasing capabilities. You can set your browser to block these Cookies, but some parts of the site may not function properly.\nInformation Storage and Access:These Cookies allow us and our partners to store and access information on the device, such as device identifiers.\nMeasurement and Analytics:These Cookies collect data regarding your usage of and performance of the Services, apply market research to generate audiences, and measure the delivery and effectiveness of content and advertising. We and our third-party vendors use these Cookies to perform analytics, so we can improve the content and user experience, develop new products and services, and for statistical purposes. They are also used to recognize you and provide further insights across platforms and devices for the above purposes.\nPersonalization Cookies:These Cookies enable us to provide certain features, such as determining if you are a first-time visitor, capping message frequency, remembering choices you have made (e.g., your language preferences, time zone), and assist you with logging in after registration (including across platforms and devices).  These Cookies also allow your device to receive and send information, so you can see and interact with ads and content.\nContent Selection and Delivery Cookies:Data collected under this category can also be used to select and deliver personalized content, such as news articles and videos.\nAd Selection and Delivery Cookies:These Cookies are used to collect data about your browsing habits, your use of the Services, your preferences, and your interaction with advertisements across platforms and devices for the purpose of delivering interest-based advertising content on the Services and on third-party sites. Third-party sites and services also use interest-based Advertising Cookies to deliver content, including advertisements relevant to your interests on the Services and third-party services. If you reject these Cookies, you may see contextual advertising that may be less relevant to you.\nSocial Media Cookies:These Cookies are set by social media platforms on the Services to enable you to share content with your friends and networks. Social media platforms have the ability to track your online activity outside of the Services. This may impact the content and messages you see on other services you visit.\nWe and third parties may associate Measurement And Analytics Cookies, Personalization Cookies, Content Selection, Delivery Cookies, and Reporting, Ad Selection, Delivery and Reporting Cookies, and Social Media Cookies with other information we have about you.\nCOOKIE MANAGEMENT\nDepending on where you live, you may be able to adjust your Cookie preferences at any time via the “Cookie Settings” link in the footer of relevant websites. You can also use the methods described below to manage Cookies. You must take such steps on each browser or device that you use. If you replace, change or upgrade your browser or device, or delete your cookies, you may need to use these opt-out tools again. As some Cookie-management solutions also rely on Cookies, please adjust your browser Cookie settings carefully, following the relevant instructions below.\nBrowser Controls: You may be able to disable and manage some Cookies through your browser settings. If you use multiple browsers on the same device, you will need to manage your settings for each browser. Please click on any of the below browser links for instructions:\nGoogle ChromeApple SafariMozila FirefoxMicrosoft Internet Explorer\nIf the browser you use is not listed above, please refer to your browser’s help menu for information on how to manage Cookies. Please be aware that disabling cookies will not disable other analytics tools we may use to collect information about you or your use of our Services.\nAnalytics Provider Opt-Outs:To disable analytics Cookies you can use the browser controls discussed above or, for some of our providers, you can use their individual opt-out mechanisms:\nGoogle’s Privacy PolicyandGoogle Analytics Opt-OutOmniture’s Privacy PolicyandOmniture’s Opt-OutMixpanel’s Privacy PolicyandMixpanel’s Opt-Out\nThe above are examples of our analytics providers and this is not an exhaustive list. We are not responsible for the effectiveness of any other providers’ opt-out mechanisms.\nFlash Local Storage:These cookies are also known as local shared objects and may be used to store your preferences or display content by us, advertisers and other third-parties. Flash cookies need to be deleted in the storage section of your Flash Player Settings Manager.\nInterest-Based Advertising:Most third-party advertisers offer a way to opt out of their interest-based advertising. For more information or to opt out of receiving interest-based advertising from participating third-party advertisers, depending on your country of residence, please visit:\nDigital Advertising Alliance in the USDigital Advertising Alliance of CanadaEuropean Interactive Digital Advertising AllianceAustralian Digital Advertising Alliance\nYou can also opt out of some of the advertising providers we use by visiting their opt-out pages:\nGoogle’s Privacy PolicyandGoogle Analytics Opt-Out PageFacebook Privacy PolicyandFacebook’s Opt-Out PageTwitter Privacy PolicyandTwitter’s Opt-Out PageLiveramp’s Privacy PolicyandLiveramp Opt-Out Page\nThese are examples of our advertising providers and this is not an exhaustive list. In addition, we are not responsible for the effectiveness of any of these providers’ opt-out mechanisms.\nAfter you opt out, you will still see advertisements, but they may not be as relevant to you.\nMobile Settings:You may manage the collection of information for interest-based advertising purposes in mobile apps via the device’s settings, including managing the collection of location data. To opt out of mobile ad tracking from Nielsen or other third parties, you can do so by selecting the “Limit Ad Tracking” (for iOS devices) or “Opt out of Ads Personalization” (for Android devices) options in your device settings.\nConnected Devices:For connected devices, such as smart TVs or streaming devices, you should review the device’s settings and select the option that allows you to disable automatic content recognition or ad tracking.  Typically, to opt out, such devices require you to select options like “limit ad tracking” or to disable options such as “interest-based advertising,” “interactive TV,” or “smart interactivity”.  These settings vary by device type.\nCross-Device Tracking:If you would like to opt out of our browser-based cross-device tracking for advertising purposes, you may do so by using the various methods described above.  You must opt out separately on each device and each browser that you use. For more information about cross-device matching, please visit the Network Advertising Initiative or the Digital Advertising Alliance. If you opt out of cross-device tracking for advertising purposes, we may still conduct cross-device tracking for other purposes, such as analytics.\nConsequences of Deactivation of Cookies: If you disable or remove Cookies, some parts of the Services may not function properly. Information may still be collected and used for other purposes, such as research, online services analytics or internal operations, and to remember your opt-out preferences.\nCONTACT US\nFor inquiries about this Cookies Notice, please contact us atPrivacy@nbcuni.comor Chief Privacy Officer, NBCUniversal Legal Department, 30 Rockefeller Plaza, New York, NY 10112, US.\nFor inquiries from users who reside in the European Economic Area, the United Kingdom or Switzerland, please contact us atPrivacy@nbcuni.comor Privacy, Legal Department, Central Saint Giles, St Giles High Street, London, WC2H 8NU, UK\nCHANGES TO THIS NOTICE\nThis Notice may be revised occasionally and in accordance with legal requirements. Please revisit this Cookie Notice regularly to stay informed about our and our analytic and advertising partners’ use of Cookies.\nThese Cookies are required for Service functionality, including security and fraud prevention, and to enable any purchasing capabilities. You can set your browser to block these Cookies, but some parts of the site may not function properly."
  },
  {
    "title": "The prospect of an Israel-Iran ceasefire dims as Trump weighs strikes",
    "url": "https://www.cnbc.com/2025/06/18/cnbc-daily-open-israel-iran-ceasefire-hope-dims-as-trump-weighs-strikes.html",
    "date": "2025-06-18",
    "content": "The prospect of an Israel-Iran ceasefire dims as Trump weighs strikes\nSummary:\nPre-Markets\nU.S. Markets\nEurope Markets\nChina Markets\nAsia Markets\nWorld Markets\nCurrencies\nCryptocurrency\nFutures & Commodities\nBonds\nFunds & ETFs\nEconomy\nFinance\nHealth & Science\nMedia\nReal Estate\nEnergy\nClimate\nTransportation\nIndustrials\nRetail\nWealth\nSports\nLife\nSmall Business\nPersonal Finance\nFintech\nFinancial Advisors\nOptions Action\nETF Street\nBuffett Archive\nEarnings\nTrader Talk\nCybersecurity\nAI\nEnterprise\nInternet\nMedia\nMobile\nSocial Media\nCNBC Disruptor 50\nTech Guide\nWhite House\nPolicy\nDefense\nCongress\nExpanding Opportunity\nEurope Politics\nChina Politics\nAsia Politics\nWorld Politics\nLatest Video\nFull Episodes\nLivestream\nTop Video\nLive Audio\nEurope TV\nAsia TV\nCNBC Podcasts\nCEO Interviews\nDigital Originals\nTrust Portfolio\nAnalysis\nTrade Alerts\nMeeting Videos\nHomestretch\nJim’s Columns\nEducation\nSubscribe\nSign In\nPro News\nLivestream\nFull Episodes\nStock Screener\nMarket Forecast\nOptions Investing\nChart Investing\nStock Lists\nSubscribe\nSign In\nMake It\nselect\nUSA\nINTL\nLivestream\nLivestream\nA U.S. military strike against Iran is one of the options Trump is considering, current and former administration officials told NBC News.\nU.S. stocks retreated Tuesday as Trump’s rhetoric on Iran ramped up. Asia markets traded mixed Wednesday.\nJapan exports in May declined 1.7% year over year, according to data from Japan’s trade ministry released Wednesday.\nOpenAI CEO Sam Altman said Meta had sought to hire “a lot of people” from the artificial intelligence company.\nThe U.S. Senate on Tuesday passed the GENIUS Act, a bill that establishes federal guardrails for U.S. dollar-pegged stablecoins.\nInvestors think global stocks will be the best-performing asset in the next five years.\n.SPX-1.85 (-0.03%)\n.IXIC+25.18 (+0.13%)\nRGC-11.77 (-18.58%)\nSubscribe to CNBC PRO\nSubscribe to Investing Club\nLicensing & Reprints\nCNBC Councils\nSupply Chain Values\nCNBC on Peacock\nJoin the CNBC Panel\nDigital Products\nNews Releases\nClosed Captioning\nCorrections\nAbout CNBC\nInternships\nSite Map\nAd Choices\nCareers\nHelp\nContact\nNews TipsGot a confidential news tip? We want to hear from you.Get In Touch\nCNBC NewslettersSign up for free newsletters and get more CNBC delivered to your inboxSign Up NowGet this delivered to your inbox, and more info about our products and services.\nAdvertise With UsPlease Contact Us\nPrivacy Policy\nCA Notice\nTerms of Service\nBody:\nIn this article\nTaken from CNBC’s Daily Open, our international markets newsletter —Subscribe today\nHopes of aquickceasefirebetween Israel and Iran were dashed by several social media posts from U.S. President Donald Trump. As he took an early departure from the Group of Seven summit, Trump said it “certainly has nothing to do with a Cease Fire” and that he was involved in something “much bigger than that.”\nWhat’s bigger than a ceasefire? An escalation in conflict on the prospect ofthe U.S. joining the hostilities in the Middle East. Trump, on his social media platform Truth Social, threatened Iran’s leader Ayatollah Ali Khamenei that he is an “easy target” and wants him to “surrender.”\nTrump’s posts on Truth Social brought U.S. stocks lower and caused oil prices, which wereon the retreat Monday, toshoot up more than 4%during Tuesday’s trading session in America. Aweaker-than-expected U.S. retail sales reportin May also added to the heavy sentiment in markets.\nThe U.S. Federal Reserve’s rate-setting meeting will conclude Wednesday. While central bankers are expected to leave interest rates unchanged, the committee will release updated projections of where they see rates going. Chair Jerome Powell will also answer questions from the media at this press conference. All of those are market-moving events — so it’s a relief, at least, they come from official communiques.\nTrump weighs strike on IranAU.S. military strike against Iranis one of the options Trump is considering, after meeting with his top national security advisors on Tuesday afternoon, current and former administration officials told NBC News. Earlier in the day, Trump wrote onTruth Socialthat the U.S. knows “exactly” where the Iran’s leader, Ayatollah AliKhamenei, is “hiding,” and demanded “UNCONDITIONAL SURRENDER!”\nU.S. markets fell while Asia trades mixedU.S. stocks retreated Tuesdayas Trump’s rhetoric on Iran ramped up. TheS&P 500fell 0.84%, the Dow Jones Industrial Average shed 0.7% and theNasdaq Compositewas down 0.91%.Asia-Pacific markets were mixed Wednesday. At 1:30 p.m. Singapore time, Japan’sNikkei 225rose 0.77% even as the government reported a drop in exports in May, while South Korea’sKospiadded 0.56%. Hong Kong’sHang Seng Index, however, lost 1.23%.\nExports from Japan fall in MayJapan exports in Maydeclined 1.7% year over year, according todata from Japan’s trade ministryreleased Wednesday. While that drop fares better than the 3.8% decline expected from a Reuters poll of economists, it’s still the steepest fall since September 2024 and reverses the 2% growth in April. Exports to the U.S. dropped 11.1% from a year earlier,much worse than than the 1.8% fall in April.\nMeta trying to poach OpenAI staff: AltmanOn apodcastreleased Tuesday, OpenAI CEO Sam Altman said Meta hadsought to hire “a lot of people”from the artificial intelligence company, and had offered signing bonuses as high as $100 million — but “so far none of our best people have decided to take them up on that.” Meta CEO Mark Zuckerberg isfrustrated with his firm’s standing in the AI space, sources told CNBC.\nU.S. passes landmark crypto billThe U.S. Senate on Tuesdaypassed the GENIUS Act, a landmark crypto bill that establishes federal guardrails, including full reserve backing, monthly audits, and anti-money laundering compliance, for U.S. dollar-peggedstablecoins. It also opens the door to a range of issuers, including banks, fintechs, and major retailers looking to launch their own stablecoins or integrate them into existing payment systems.\n[PRO]Global stocks will reign: InvestorsThe era of U.S. exceptionalism might be coming to an end. Not only have global stocks vastly outperformed those in America year to date, investors also thinkthey will be thebest-performing asset classover the next five years, according to the results of Bank of America’s latest fund manager survey.\nThe Fed is likely to keep rates the same but give a forecast that moves markets. What to expect\nWhile any immediate movement on interest rates seems improbable, the Federal Reserve’s policy meeting, which concludes Wednesday, will feature important signals that still could move markets.\nAmong the biggest things to watch will be whether Federal Open Market Committee members stick with their previous forecast of two rate cuts this year, how they see inflation trending, and any reaction from ChairJerome Powellto what has become a concerted White House campaign for easier monetary policy.\nAs things stand heading into the meeting, markets are pricing in the next cut to come in September, which would be the one-year anniversary of a surprisingly aggressivehalf-percentage-point reductionthe FOMC instituted amid concerns over the labor market. The committee added two more quarter-point moves by the end of the year and has been on hold since.\nGot a confidential news tip? We want to hear from you.\nSign up for free newsletters and get more CNBC delivered to your inbox\nGet this delivered to your inbox, and more info about our products and services.\n©2025CNBC LLC. All Rights Reserved.A Division of NBCUniversal\nData is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.\nData also provided by\nThis Cookie Notice (“Notice”) explains how NBCUniversal andits affiliates(“NBCUniversal” or “we”), along with our partners, including advertisers and vendors, use cookies and similar tracking technologies when you use our websites, applications, such as games, interactive TV, voice-activated assistants, and other services that link to this policy, as well as connected devices, including those used in our theme parks (“Services”). This Notice provides more information about these technologies, your choices, and is part of the NBCUniversal Privacy Policy availablehere. You should read the Privacy Policy and this Notice for a full picture of NBCUniversal’s use of your information.\nWHAT ARE COOKIES AND HOW ARE THEY USED?\nLike many companies, we use cookies (small text files placed on your computer or device) and other tracking technologies on the Services (referred to together from this point forward as “Cookies”, unless otherwise stated), including HTTP cookies, HTML5 and Flash local storage/flash cookies, web beacons/GIFs, embedded scripts, ETags/cache browsers, and software development kits.\nFirst-party Cookies\nFirst-party Cookies are placed by us (including through the use of third-party service providers) and are used to allow you to use the Services and their features and to assist in analytics activities.\nThird-party Cookies\nCertain third parties may place their Cookies on your device and use them to recognize your device when you visit the Services and when you visit other websites or online services. These third parties collect and use this information pursuant to their own privacy policies. Third-party Cookies enable certain features or functionalities, and advertising, to be provided on the Services.\nTypes of Cookies\nThe Services use the following types of first and third-party Cookies for these purposes:\nStrictly Necessary Cookies:These Cookies are required for Service functionality, including for system administration, security and fraud prevention, and to enable any purchasing capabilities. You can set your browser to block these Cookies, but some parts of the site may not function properly.\nInformation Storage and Access:These Cookies allow us and our partners to store and access information on the device, such as device identifiers.\nMeasurement and Analytics:These Cookies collect data regarding your usage of and performance of the Services, apply market research to generate audiences, and measure the delivery and effectiveness of content and advertising. We and our third-party vendors use these Cookies to perform analytics, so we can improve the content and user experience, develop new products and services, and for statistical purposes. They are also used to recognize you and provide further insights across platforms and devices for the above purposes.\nPersonalization Cookies:These Cookies enable us to provide certain features, such as determining if you are a first-time visitor, capping message frequency, remembering choices you have made (e.g., your language preferences, time zone), and assist you with logging in after registration (including across platforms and devices).  These Cookies also allow your device to receive and send information, so you can see and interact with ads and content.\nContent Selection and Delivery Cookies:Data collected under this category can also be used to select and deliver personalized content, such as news articles and videos.\nAd Selection and Delivery Cookies:These Cookies are used to collect data about your browsing habits, your use of the Services, your preferences, and your interaction with advertisements across platforms and devices for the purpose of delivering interest-based advertising content on the Services and on third-party sites. Third-party sites and services also use interest-based Advertising Cookies to deliver content, including advertisements relevant to your interests on the Services and third-party services. If you reject these Cookies, you may see contextual advertising that may be less relevant to you.\nSocial Media Cookies:These Cookies are set by social media platforms on the Services to enable you to share content with your friends and networks. Social media platforms have the ability to track your online activity outside of the Services. This may impact the content and messages you see on other services you visit.\nWe and third parties may associate Measurement And Analytics Cookies, Personalization Cookies, Content Selection, Delivery Cookies, and Reporting, Ad Selection, Delivery and Reporting Cookies, and Social Media Cookies with other information we have about you.\nCOOKIE MANAGEMENT\nDepending on where you live, you may be able to adjust your Cookie preferences at any time via the “Cookie Settings” link in the footer of relevant websites. You can also use the methods described below to manage Cookies. You must take such steps on each browser or device that you use. If you replace, change or upgrade your browser or device, or delete your cookies, you may need to use these opt-out tools again. As some Cookie-management solutions also rely on Cookies, please adjust your browser Cookie settings carefully, following the relevant instructions below.\nBrowser Controls: You may be able to disable and manage some Cookies through your browser settings. If you use multiple browsers on the same device, you will need to manage your settings for each browser. Please click on any of the below browser links for instructions:\nGoogle ChromeApple SafariMozila FirefoxMicrosoft Internet Explorer\nIf the browser you use is not listed above, please refer to your browser’s help menu for information on how to manage Cookies. Please be aware that disabling cookies will not disable other analytics tools we may use to collect information about you or your use of our Services.\nAnalytics Provider Opt-Outs:To disable analytics Cookies you can use the browser controls discussed above or, for some of our providers, you can use their individual opt-out mechanisms:\nGoogle’s Privacy PolicyandGoogle Analytics Opt-OutOmniture’s Privacy PolicyandOmniture’s Opt-OutMixpanel’s Privacy PolicyandMixpanel’s Opt-Out\nThe above are examples of our analytics providers and this is not an exhaustive list. We are not responsible for the effectiveness of any other providers’ opt-out mechanisms.\nFlash Local Storage:These cookies are also known as local shared objects and may be used to store your preferences or display content by us, advertisers and other third-parties. Flash cookies need to be deleted in the storage section of your Flash Player Settings Manager.\nInterest-Based Advertising:Most third-party advertisers offer a way to opt out of their interest-based advertising. For more information or to opt out of receiving interest-based advertising from participating third-party advertisers, depending on your country of residence, please visit:\nDigital Advertising Alliance in the USDigital Advertising Alliance of CanadaEuropean Interactive Digital Advertising AllianceAustralian Digital Advertising Alliance\nYou can also opt out of some of the advertising providers we use by visiting their opt-out pages:\nGoogle’s Privacy PolicyandGoogle Analytics Opt-Out PageFacebook Privacy PolicyandFacebook’s Opt-Out PageTwitter Privacy PolicyandTwitter’s Opt-Out PageLiveramp’s Privacy PolicyandLiveramp Opt-Out Page\nThese are examples of our advertising providers and this is not an exhaustive list. In addition, we are not responsible for the effectiveness of any of these providers’ opt-out mechanisms.\nAfter you opt out, you will still see advertisements, but they may not be as relevant to you.\nMobile Settings:You may manage the collection of information for interest-based advertising purposes in mobile apps via the device’s settings, including managing the collection of location data. To opt out of mobile ad tracking from Nielsen or other third parties, you can do so by selecting the “Limit Ad Tracking” (for iOS devices) or “Opt out of Ads Personalization” (for Android devices) options in your device settings.\nConnected Devices:For connected devices, such as smart TVs or streaming devices, you should review the device’s settings and select the option that allows you to disable automatic content recognition or ad tracking.  Typically, to opt out, such devices require you to select options like “limit ad tracking” or to disable options such as “interest-based advertising,” “interactive TV,” or “smart interactivity”.  These settings vary by device type.\nCross-Device Tracking:If you would like to opt out of our browser-based cross-device tracking for advertising purposes, you may do so by using the various methods described above.  You must opt out separately on each device and each browser that you use. For more information about cross-device matching, please visit the Network Advertising Initiative or the Digital Advertising Alliance. If you opt out of cross-device tracking for advertising purposes, we may still conduct cross-device tracking for other purposes, such as analytics.\nConsequences of Deactivation of Cookies: If you disable or remove Cookies, some parts of the Services may not function properly. Information may still be collected and used for other purposes, such as research, online services analytics or internal operations, and to remember your opt-out preferences.\nCONTACT US\nFor inquiries about this Cookies Notice, please contact us atPrivacy@nbcuni.comor Chief Privacy Officer, NBCUniversal Legal Department, 30 Rockefeller Plaza, New York, NY 10112, US.\nFor inquiries from users who reside in the European Economic Area, the United Kingdom or Switzerland, please contact us atPrivacy@nbcuni.comor Privacy, Legal Department, Central Saint Giles, St Giles High Street, London, WC2H 8NU, UK\nCHANGES TO THIS NOTICE\nThis Notice may be revised occasionally and in accordance with legal requirements. Please revisit this Cookie Notice regularly to stay informed about our and our analytic and advertising partners’ use of Cookies.\nThese Cookies are required for Service functionality, including security and fraud prevention, and to enable any purchasing capabilities. You can set your browser to block these Cookies, but some parts of the site may not function properly."
  },
  {
    "title": "Fed chairs are tough on policy in final year, and Powell is no different: DataTrek’s Colas",
    "url": "https://www.cnbc.com/2025/06/17/fed-chairs-are-tough-on-policy-in-final-year-powell-too-datatreks-colas.html",
    "date": "2025-06-17",
    "content": "Fed chairs are tough on policy in final year, and Powell is no different: DataTrek’s Colas\nSummary:\nPre-Markets\nU.S. Markets\nEurope Markets\nChina Markets\nAsia Markets\nWorld Markets\nCurrencies\nCryptocurrency\nFutures & Commodities\nBonds\nFunds & ETFs\nEconomy\nFinance\nHealth & Science\nMedia\nReal Estate\nEnergy\nClimate\nTransportation\nIndustrials\nRetail\nWealth\nSports\nLife\nSmall Business\nPersonal Finance\nFintech\nFinancial Advisors\nOptions Action\nETF Street\nBuffett Archive\nEarnings\nTrader Talk\nCybersecurity\nAI\nEnterprise\nInternet\nMedia\nMobile\nSocial Media\nCNBC Disruptor 50\nTech Guide\nWhite House\nPolicy\nDefense\nCongress\nExpanding Opportunity\nEurope Politics\nChina Politics\nAsia Politics\nWorld Politics\nLatest Video\nFull Episodes\nLivestream\nTop Video\nLive Audio\nEurope TV\nAsia TV\nCNBC Podcasts\nCEO Interviews\nDigital Originals\nTrust Portfolio\nAnalysis\nTrade Alerts\nMeeting Videos\nHomestretch\nJim’s Columns\nEducation\nSubscribe\nSign In\nPro News\nLivestream\nFull Episodes\nStock Screener\nMarket Forecast\nOptions Investing\nChart Investing\nStock Lists\nSubscribe\nSign In\nMake It\nselect\nUSA\nINTL\nLivestream\nLivestream\nThe so-called hard economic data is starting to raise some eyebrows\nFund managers are pouring money into emerging markets. Here’s where investors see opportunities\nHere’s how Wall Street is reacting to the Fed’s updated rate cut outlook\nThe big rally in this chip stock seems to have some legs, according to the charts\nFinancial advisors are turning to this asset class for diversification and stability\nSubscribe to CNBC PRO\nSubscribe to Investing Club\nLicensing & Reprints\nCNBC Councils\nSupply Chain Values\nCNBC on Peacock\nJoin the CNBC Panel\nDigital Products\nNews Releases\nClosed Captioning\nCorrections\nAbout CNBC\nInternships\nSite Map\nAd Choices\nCareers\nHelp\nContact\nNews TipsGot a confidential news tip? We want to hear from you.Get In Touch\nCNBC NewslettersSign up for free newsletters and get more CNBC delivered to your inboxSign Up NowGet this delivered to your inbox, and more info about our products and services.\nAdvertise With UsPlease Contact Us\nPrivacy Policy\nCA Notice\nTerms of Service\nBody:\nGot a confidential news tip? We want to hear from you.\nSign up for free newsletters and get more CNBC delivered to your inbox\nGet this delivered to your inbox, and more info about our products and services.\n©2025CNBC LLC. All Rights Reserved.A Division of NBCUniversal\nData is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.\nData also provided by\nThis Cookie Notice (“Notice”) explains how NBCUniversal andits affiliates(“NBCUniversal” or “we”), along with our partners, including advertisers and vendors, use cookies and similar tracking technologies when you use our websites, applications, such as games, interactive TV, voice-activated assistants, and other services that link to this policy, as well as connected devices, including those used in our theme parks (“Services”). This Notice provides more information about these technologies, your choices, and is part of the NBCUniversal Privacy Policy availablehere. You should read the Privacy Policy and this Notice for a full picture of NBCUniversal’s use of your information.\nWHAT ARE COOKIES AND HOW ARE THEY USED?\nLike many companies, we use cookies (small text files placed on your computer or device) and other tracking technologies on the Services (referred to together from this point forward as “Cookies”, unless otherwise stated), including HTTP cookies, HTML5 and Flash local storage/flash cookies, web beacons/GIFs, embedded scripts, ETags/cache browsers, and software development kits.\nFirst-party Cookies\nFirst-party Cookies are placed by us (including through the use of third-party service providers) and are used to allow you to use the Services and their features and to assist in analytics activities.\nThird-party Cookies\nCertain third parties may place their Cookies on your device and use them to recognize your device when you visit the Services and when you visit other websites or online services. These third parties collect and use this information pursuant to their own privacy policies. Third-party Cookies enable certain features or functionalities, and advertising, to be provided on the Services.\nTypes of Cookies\nThe Services use the following types of first and third-party Cookies for these purposes:\nStrictly Necessary Cookies:These Cookies are required for Service functionality, including for system administration, security and fraud prevention, and to enable any purchasing capabilities. You can set your browser to block these Cookies, but some parts of the site may not function properly.\nInformation Storage and Access:These Cookies allow us and our partners to store and access information on the device, such as device identifiers.\nMeasurement and Analytics:These Cookies collect data regarding your usage of and performance of the Services, apply market research to generate audiences, and measure the delivery and effectiveness of content and advertising. We and our third-party vendors use these Cookies to perform analytics, so we can improve the content and user experience, develop new products and services, and for statistical purposes. They are also used to recognize you and provide further insights across platforms and devices for the above purposes.\nPersonalization Cookies:These Cookies enable us to provide certain features, such as determining if you are a first-time visitor, capping message frequency, remembering choices you have made (e.g., your language preferences, time zone), and assist you with logging in after registration (including across platforms and devices).  These Cookies also allow your device to receive and send information, so you can see and interact with ads and content.\nContent Selection and Delivery Cookies:Data collected under this category can also be used to select and deliver personalized content, such as news articles and videos.\nAd Selection and Delivery Cookies:These Cookies are used to collect data about your browsing habits, your use of the Services, your preferences, and your interaction with advertisements across platforms and devices for the purpose of delivering interest-based advertising content on the Services and on third-party sites. Third-party sites and services also use interest-based Advertising Cookies to deliver content, including advertisements relevant to your interests on the Services and third-party services. If you reject these Cookies, you may see contextual advertising that may be less relevant to you.\nSocial Media Cookies:These Cookies are set by social media platforms on the Services to enable you to share content with your friends and networks. Social media platforms have the ability to track your online activity outside of the Services. This may impact the content and messages you see on other services you visit.\nWe and third parties may associate Measurement And Analytics Cookies, Personalization Cookies, Content Selection, Delivery Cookies, and Reporting, Ad Selection, Delivery and Reporting Cookies, and Social Media Cookies with other information we have about you.\nCOOKIE MANAGEMENT\nDepending on where you live, you may be able to adjust your Cookie preferences at any time via the “Cookie Settings” link in the footer of relevant websites. You can also use the methods described below to manage Cookies. You must take such steps on each browser or device that you use. If you replace, change or upgrade your browser or device, or delete your cookies, you may need to use these opt-out tools again. As some Cookie-management solutions also rely on Cookies, please adjust your browser Cookie settings carefully, following the relevant instructions below.\nBrowser Controls: You may be able to disable and manage some Cookies through your browser settings. If you use multiple browsers on the same device, you will need to manage your settings for each browser. Please click on any of the below browser links for instructions:\nGoogle ChromeApple SafariMozila FirefoxMicrosoft Internet Explorer\nIf the browser you use is not listed above, please refer to your browser’s help menu for information on how to manage Cookies. Please be aware that disabling cookies will not disable other analytics tools we may use to collect information about you or your use of our Services.\nAnalytics Provider Opt-Outs:To disable analytics Cookies you can use the browser controls discussed above or, for some of our providers, you can use their individual opt-out mechanisms:\nGoogle’s Privacy PolicyandGoogle Analytics Opt-OutOmniture’s Privacy PolicyandOmniture’s Opt-OutMixpanel’s Privacy PolicyandMixpanel’s Opt-Out\nThe above are examples of our analytics providers and this is not an exhaustive list. We are not responsible for the effectiveness of any other providers’ opt-out mechanisms.\nFlash Local Storage:These cookies are also known as local shared objects and may be used to store your preferences or display content by us, advertisers and other third-parties. Flash cookies need to be deleted in the storage section of your Flash Player Settings Manager.\nInterest-Based Advertising:Most third-party advertisers offer a way to opt out of their interest-based advertising. For more information or to opt out of receiving interest-based advertising from participating third-party advertisers, depending on your country of residence, please visit:\nDigital Advertising Alliance in the USDigital Advertising Alliance of CanadaEuropean Interactive Digital Advertising AllianceAustralian Digital Advertising Alliance\nYou can also opt out of some of the advertising providers we use by visiting their opt-out pages:\nGoogle’s Privacy PolicyandGoogle Analytics Opt-Out PageFacebook Privacy PolicyandFacebook’s Opt-Out PageTwitter Privacy PolicyandTwitter’s Opt-Out PageLiveramp’s Privacy PolicyandLiveramp Opt-Out Page\nThese are examples of our advertising providers and this is not an exhaustive list. In addition, we are not responsible for the effectiveness of any of these providers’ opt-out mechanisms.\nAfter you opt out, you will still see advertisements, but they may not be as relevant to you.\nMobile Settings:You may manage the collection of information for interest-based advertising purposes in mobile apps via the device’s settings, including managing the collection of location data. To opt out of mobile ad tracking from Nielsen or other third parties, you can do so by selecting the “Limit Ad Tracking” (for iOS devices) or “Opt out of Ads Personalization” (for Android devices) options in your device settings.\nConnected Devices:For connected devices, such as smart TVs or streaming devices, you should review the device’s settings and select the option that allows you to disable automatic content recognition or ad tracking.  Typically, to opt out, such devices require you to select options like “limit ad tracking” or to disable options such as “interest-based advertising,” “interactive TV,” or “smart interactivity”.  These settings vary by device type.\nCross-Device Tracking:If you would like to opt out of our browser-based cross-device tracking for advertising purposes, you may do so by using the various methods described above.  You must opt out separately on each device and each browser that you use. For more information about cross-device matching, please visit the Network Advertising Initiative or the Digital Advertising Alliance. If you opt out of cross-device tracking for advertising purposes, we may still conduct cross-device tracking for other purposes, such as analytics.\nConsequences of Deactivation of Cookies: If you disable or remove Cookies, some parts of the Services may not function properly. Information may still be collected and used for other purposes, such as research, online services analytics or internal operations, and to remember your opt-out preferences.\nCONTACT US\nFor inquiries about this Cookies Notice, please contact us atPrivacy@nbcuni.comor Chief Privacy Officer, NBCUniversal Legal Department, 30 Rockefeller Plaza, New York, NY 10112, US.\nFor inquiries from users who reside in the European Economic Area, the United Kingdom or Switzerland, please contact us atPrivacy@nbcuni.comor Privacy, Legal Department, Central Saint Giles, St Giles High Street, London, WC2H 8NU, UK\nCHANGES TO THIS NOTICE\nThis Notice may be revised occasionally and in accordance with legal requirements. Please revisit this Cookie Notice regularly to stay informed about our and our analytic and advertising partners’ use of Cookies.\nThese Cookies are required for Service functionality, including security and fraud prevention, and to enable any purchasing capabilities. You can set your browser to block these Cookies, but some parts of the site may not function properly."
  },
  {
    "title": "Investors see stagflation ahead but slow interest rate cuts, CNBC Fed survey finds",
    "url": "https://www.cnbc.com/2025/06/17/investor-see-stagflation-ahead-but-slow-interest-rate-cuts-cnbc-fed-survey-finds.html",
    "date": "2025-06-17",
    "content": "Investors see stagflation ahead but slow interest rate cuts, CNBC Fed survey finds\nSummary:\nPre-Markets\nU.S. Markets\nEurope Markets\nChina Markets\nAsia Markets\nWorld Markets\nCurrencies\nCryptocurrency\nFutures & Commodities\nBonds\nFunds & ETFs\nEconomy\nFinance\nHealth & Science\nMedia\nReal Estate\nEnergy\nClimate\nTransportation\nIndustrials\nRetail\nWealth\nSports\nLife\nSmall Business\nPersonal Finance\nFintech\nFinancial Advisors\nOptions Action\nETF Street\nBuffett Archive\nEarnings\nTrader Talk\nCybersecurity\nAI\nEnterprise\nInternet\nMedia\nMobile\nSocial Media\nCNBC Disruptor 50\nTech Guide\nWhite House\nPolicy\nDefense\nCongress\nExpanding Opportunity\nEurope Politics\nChina Politics\nAsia Politics\nWorld Politics\nLatest Video\nFull Episodes\nLivestream\nTop Video\nLive Audio\nEurope TV\nAsia TV\nCNBC Podcasts\nCEO Interviews\nDigital Originals\nTrust Portfolio\nAnalysis\nTrade Alerts\nMeeting Videos\nHomestretch\nJim’s Columns\nEducation\nSubscribe\nSign In\nPro News\nLivestream\nFull Episodes\nStock Screener\nMarket Forecast\nOptions Investing\nChart Investing\nStock Lists\nSubscribe\nSign In\nMake It\nselect\nUSA\nINTL\nLivestream\nLivestream\nThe June CNBC Fed Survey continued to indicate weaker growth and higher inflation than at the beginning of the year and most say uncertainty over tariff policy remains high.\nThe Fed is expected to stand pat at the June meeting and not cut rates until September. The 28 respondents, who include economists, fund managers and analysts, see two rate reductions this year.\nRespondents say there remains a considerable lack of clarity with 71% reporting they are very or somewhat uncertain over trade policy.\nSubscribe to CNBC PRO\nSubscribe to Investing Club\nLicensing & Reprints\nCNBC Councils\nSupply Chain Values\nCNBC on Peacock\nJoin the CNBC Panel\nDigital Products\nNews Releases\nClosed Captioning\nCorrections\nAbout CNBC\nInternships\nSite Map\nAd Choices\nCareers\nHelp\nContact\nNews TipsGot a confidential news tip? We want to hear from you.Get In Touch\nCNBC NewslettersSign up for free newsletters and get more CNBC delivered to your inboxSign Up NowGet this delivered to your inbox, and more info about our products and services.\nAdvertise With UsPlease Contact Us\nPrivacy Policy\nCA Notice\nTerms of Service\nBody:\nDespite some improvement in the economic outlook, respondents to the June CNBC Fed Survey continue to forecast weaker growth and higher inflation than they did at the beginning of the year and most say uncertainty over tariff policy remains high.\nThe probability of a recession in the next year has fallen to 38%, down from 53% in May, but above the 23% level of January before PresidentDonald Trump’s aggressive tariff policy was unveiled.\nSimilarly,gross domestic productis now expected to grow 1.13% on average, up from 0.8% in the prior survey, but less than half the January expectation.\nRespondents say there remains a considerable lack of clarity with 71% reporting they are very or somewhat uncertain overtrade policy.\n“Recent geopolitical events in the Middle East add uncertainty into an already uncertain environment on trade, tax policy, and with potentially weakening hard macroeconomic data pending,” said Doug Gordon, senior portfolio manager at Russell Investments. “Recession can be avoided, although this will require some help in mitigating some of these sources of volatility.”\nThe help, he said, comes from trade deals and tax policy, with 29% saying the current tax bill in Congress makes them more optimistic about growth and 29% say it makes them more pessimistic; 43% say it has no effect on their growth outlook.\nYet 82% believe it will “somewhat” or “significantly increase” the federal budget deficit.\nA 54% majority expect the U.S. to strike a newtrade deal with China, compared with 39% who do not. On average, those looking for a trade deal believe it will be signed within about five months.\n“While it appears that the worst-case scenario when it comes to tariffs will not happen, the best-case scenario still implies significantly higher tariffs and therefore higher inflation for an extended period,″ said Joel Naroff, president, Naroff Economics.\nThe Federal Reserve isexpected to stand pat at the June meetingand not cut rates until September. The 28 respondents, who include economists, fund managers and analysts, see two rate reductions this year, bringing the funds rate down to 3.9% by year-end, but only one 25 basis point cut next year.\n“There are multiple cross currents from geopolitical events that the Fed will have to weigh,” said Constance Hunter, chief economist at the Economist Intelligence Unit. “The see-saw between slower growth and adverse supply shocks are difficult to forecast, however we expect slower growth will ultimately be what causes the Fed to move closer to a neutral stance.”\nAsked how the Fed would react to astagflationary outcomeof higher prices and weaker growth, 54% believe the central bank will cut rates while 39% see the Fed holding rates steady. That’s a bit more hawkish than May when 65% saw the Fed cutting.\nBy a slim margin, respondents don’t believe the Fed will face that dilemma: 43% believe tariffs will result in just “one-time price increases” while 32% say they create a broader inflationary problem.\nHowever, 61% say tariff inflation in future months will show up “more significantly” than it has, while 36% see it as appearing “only modestly.”\n“I expect (economic) moderation going forward as tariffs get incorporated into consumer prices and slower job growth due in part to a slower pace of immigration providing less fuel for aggregate disposable income,” said Jack Kleinhenz, chief economist at the National Retail Federation.\nAmid all those concerns, Mark Vitner, chief economist at Piedmont Crescent Capital & CAVU Securities, notes that the economy has remained “Resilient, Not ‘Tariffied.’”\n“There’s no shortage of reasons to worry — elevated interest rates, huge budget deficits, geopolitical flare-ups, tariff threats — but the U.S. economy keeps proving its doubters wrong.”\nHe added, “Consumers continue to spend, and businesses are doubling down on future-facing infrastructure: AI, life sciences, DefenseTech, and other emerging technologies.”\nIndeed, the outlook for stocks rose, with the S&P 500 now expected to hit 6,133 by year-end, for a modest 1.7% rise from current levels, but a more robust 10% increase to 6,625 by the end of 2026.\n“Equity markets are near all-time highs in anticipation of certainty replacing uncertainty on tariffs, the 2017 tax cuts getting extended, deregulation, AI productivity, and Fed easing,” said Hank Smith, head of investment strategy, Haverford Trust Co. “If all of this occurs, the economy should reaccelerate in the second half into ’26.”\nWhen it comes to current stock levels, 58% believe they are overpriced, and 36% believe them to be correctly priced relative to their outlook for earnings and the economy. Just 7% see equities as underpriced.\nGot a confidential news tip? We want to hear from you.\nSign up for free newsletters and get more CNBC delivered to your inbox\nGet this delivered to your inbox, and more info about our products and services.\n©2025CNBC LLC. All Rights Reserved.A Division of NBCUniversal\nData is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.\nData also provided by\nThis Cookie Notice (“Notice”) explains how NBCUniversal andits affiliates(“NBCUniversal” or “we”), along with our partners, including advertisers and vendors, use cookies and similar tracking technologies when you use our websites, applications, such as games, interactive TV, voice-activated assistants, and other services that link to this policy, as well as connected devices, including those used in our theme parks (“Services”). This Notice provides more information about these technologies, your choices, and is part of the NBCUniversal Privacy Policy availablehere. You should read the Privacy Policy and this Notice for a full picture of NBCUniversal’s use of your information.\nWHAT ARE COOKIES AND HOW ARE THEY USED?\nLike many companies, we use cookies (small text files placed on your computer or device) and other tracking technologies on the Services (referred to together from this point forward as “Cookies”, unless otherwise stated), including HTTP cookies, HTML5 and Flash local storage/flash cookies, web beacons/GIFs, embedded scripts, ETags/cache browsers, and software development kits.\nFirst-party Cookies\nFirst-party Cookies are placed by us (including through the use of third-party service providers) and are used to allow you to use the Services and their features and to assist in analytics activities.\nThird-party Cookies\nCertain third parties may place their Cookies on your device and use them to recognize your device when you visit the Services and when you visit other websites or online services. These third parties collect and use this information pursuant to their own privacy policies. Third-party Cookies enable certain features or functionalities, and advertising, to be provided on the Services.\nTypes of Cookies\nThe Services use the following types of first and third-party Cookies for these purposes:\nStrictly Necessary Cookies:These Cookies are required for Service functionality, including for system administration, security and fraud prevention, and to enable any purchasing capabilities. You can set your browser to block these Cookies, but some parts of the site may not function properly.\nInformation Storage and Access:These Cookies allow us and our partners to store and access information on the device, such as device identifiers.\nMeasurement and Analytics:These Cookies collect data regarding your usage of and performance of the Services, apply market research to generate audiences, and measure the delivery and effectiveness of content and advertising. We and our third-party vendors use these Cookies to perform analytics, so we can improve the content and user experience, develop new products and services, and for statistical purposes. They are also used to recognize you and provide further insights across platforms and devices for the above purposes.\nPersonalization Cookies:These Cookies enable us to provide certain features, such as determining if you are a first-time visitor, capping message frequency, remembering choices you have made (e.g., your language preferences, time zone), and assist you with logging in after registration (including across platforms and devices).  These Cookies also allow your device to receive and send information, so you can see and interact with ads and content.\nContent Selection and Delivery Cookies:Data collected under this category can also be used to select and deliver personalized content, such as news articles and videos.\nAd Selection and Delivery Cookies:These Cookies are used to collect data about your browsing habits, your use of the Services, your preferences, and your interaction with advertisements across platforms and devices for the purpose of delivering interest-based advertising content on the Services and on third-party sites. Third-party sites and services also use interest-based Advertising Cookies to deliver content, including advertisements relevant to your interests on the Services and third-party services. If you reject these Cookies, you may see contextual advertising that may be less relevant to you.\nSocial Media Cookies:These Cookies are set by social media platforms on the Services to enable you to share content with your friends and networks. Social media platforms have the ability to track your online activity outside of the Services. This may impact the content and messages you see on other services you visit.\nWe and third parties may associate Measurement And Analytics Cookies, Personalization Cookies, Content Selection, Delivery Cookies, and Reporting, Ad Selection, Delivery and Reporting Cookies, and Social Media Cookies with other information we have about you.\nCOOKIE MANAGEMENT\nDepending on where you live, you may be able to adjust your Cookie preferences at any time via the “Cookie Settings” link in the footer of relevant websites. You can also use the methods described below to manage Cookies. You must take such steps on each browser or device that you use. If you replace, change or upgrade your browser or device, or delete your cookies, you may need to use these opt-out tools again. As some Cookie-management solutions also rely on Cookies, please adjust your browser Cookie settings carefully, following the relevant instructions below.\nBrowser Controls: You may be able to disable and manage some Cookies through your browser settings. If you use multiple browsers on the same device, you will need to manage your settings for each browser. Please click on any of the below browser links for instructions:\nGoogle ChromeApple SafariMozila FirefoxMicrosoft Internet Explorer\nIf the browser you use is not listed above, please refer to your browser’s help menu for information on how to manage Cookies. Please be aware that disabling cookies will not disable other analytics tools we may use to collect information about you or your use of our Services.\nAnalytics Provider Opt-Outs:To disable analytics Cookies you can use the browser controls discussed above or, for some of our providers, you can use their individual opt-out mechanisms:\nGoogle’s Privacy PolicyandGoogle Analytics Opt-OutOmniture’s Privacy PolicyandOmniture’s Opt-OutMixpanel’s Privacy PolicyandMixpanel’s Opt-Out\nThe above are examples of our analytics providers and this is not an exhaustive list. We are not responsible for the effectiveness of any other providers’ opt-out mechanisms.\nFlash Local Storage:These cookies are also known as local shared objects and may be used to store your preferences or display content by us, advertisers and other third-parties. Flash cookies need to be deleted in the storage section of your Flash Player Settings Manager.\nInterest-Based Advertising:Most third-party advertisers offer a way to opt out of their interest-based advertising. For more information or to opt out of receiving interest-based advertising from participating third-party advertisers, depending on your country of residence, please visit:\nDigital Advertising Alliance in the USDigital Advertising Alliance of CanadaEuropean Interactive Digital Advertising AllianceAustralian Digital Advertising Alliance\nYou can also opt out of some of the advertising providers we use by visiting their opt-out pages:\nGoogle’s Privacy PolicyandGoogle Analytics Opt-Out PageFacebook Privacy PolicyandFacebook’s Opt-Out PageTwitter Privacy PolicyandTwitter’s Opt-Out PageLiveramp’s Privacy PolicyandLiveramp Opt-Out Page\nThese are examples of our advertising providers and this is not an exhaustive list. In addition, we are not responsible for the effectiveness of any of these providers’ opt-out mechanisms.\nAfter you opt out, you will still see advertisements, but they may not be as relevant to you.\nMobile Settings:You may manage the collection of information for interest-based advertising purposes in mobile apps via the device’s settings, including managing the collection of location data. To opt out of mobile ad tracking from Nielsen or other third parties, you can do so by selecting the “Limit Ad Tracking” (for iOS devices) or “Opt out of Ads Personalization” (for Android devices) options in your device settings.\nConnected Devices:For connected devices, such as smart TVs or streaming devices, you should review the device’s settings and select the option that allows you to disable automatic content recognition or ad tracking.  Typically, to opt out, such devices require you to select options like “limit ad tracking” or to disable options such as “interest-based advertising,” “interactive TV,” or “smart interactivity”.  These settings vary by device type.\nCross-Device Tracking:If you would like to opt out of our browser-based cross-device tracking for advertising purposes, you may do so by using the various methods described above.  You must opt out separately on each device and each browser that you use. For more information about cross-device matching, please visit the Network Advertising Initiative or the Digital Advertising Alliance. If you opt out of cross-device tracking for advertising purposes, we may still conduct cross-device tracking for other purposes, such as analytics.\nConsequences of Deactivation of Cookies: If you disable or remove Cookies, some parts of the Services may not function properly. Information may still be collected and used for other purposes, such as research, online services analytics or internal operations, and to remember your opt-out preferences.\nCONTACT US\nFor inquiries about this Cookies Notice, please contact us atPrivacy@nbcuni.comor Chief Privacy Officer, NBCUniversal Legal Department, 30 Rockefeller Plaza, New York, NY 10112, US.\nFor inquiries from users who reside in the European Economic Area, the United Kingdom or Switzerland, please contact us atPrivacy@nbcuni.comor Privacy, Legal Department, Central Saint Giles, St Giles High Street, London, WC2H 8NU, UK\nCHANGES TO THIS NOTICE\nThis Notice may be revised occasionally and in accordance with legal requirements. Please revisit this Cookie Notice regularly to stay informed about our and our analytic and advertising partners’ use of Cookies.\nThese Cookies are required for Service functionality, including security and fraud prevention, and to enable any purchasing capabilities. You can set your browser to block these Cookies, but some parts of the site may not function properly."
  },
  {
    "title": "What the Fed’s upcoming decision on interest rates could mean for your money",
    "url": "https://www.cnbc.com/2025/06/16/fed-likely-to-hold-interest-rates-steady-what-that-means-for-you.html",
    "date": "2025-06-16",
    "content": "What the Fed’s upcoming decision on interest rates could mean for your money\nSummary:\nPre-Markets\nU.S. Markets\nEurope Markets\nChina Markets\nAsia Markets\nWorld Markets\nCurrencies\nCryptocurrency\nFutures & Commodities\nBonds\nFunds & ETFs\nEconomy\nFinance\nHealth & Science\nMedia\nReal Estate\nEnergy\nClimate\nTransportation\nIndustrials\nRetail\nWealth\nSports\nLife\nSmall Business\nPersonal Finance\nFintech\nFinancial Advisors\nOptions Action\nETF Street\nBuffett Archive\nEarnings\nTrader Talk\nCybersecurity\nAI\nEnterprise\nInternet\nMedia\nMobile\nSocial Media\nCNBC Disruptor 50\nTech Guide\nWhite House\nPolicy\nDefense\nCongress\nExpanding Opportunity\nEurope Politics\nChina Politics\nAsia Politics\nWorld Politics\nLatest Video\nFull Episodes\nLivestream\nTop Video\nLive Audio\nEurope TV\nAsia TV\nCNBC Podcasts\nCEO Interviews\nDigital Originals\nTrust Portfolio\nAnalysis\nTrade Alerts\nMeeting Videos\nHomestretch\nJim’s Columns\nEducation\nSubscribe\nSign In\nPro News\nLivestream\nFull Episodes\nStock Screener\nMarket Forecast\nOptions Investing\nChart Investing\nStock Lists\nSubscribe\nSign In\nMake It\nselect\nUSA\nINTL\nLivestream\nLivestream\nDespite escalating political pressure, the Federal Reserve is widely expected to hold its benchmark short-term borrowing rate steady at its meeting this week.\nAll sorts of consumer borrowing costs could be impacted by the Fed’s upcoming decision.\nGoldman says ‘TINA trade’ is alive and well, fueled by 401(k) buying\nBest stocks: Defense, including these 2 names, may be in secular bull market as global conflicts mount\nWhat Amazon and Walmart’s reported stablecoin exploration means for payments stocks\nGoldman Sachs says buy these five stocks that are set to rally\nSubscribe to CNBC PRO\nSubscribe to Investing Club\nLicensing & Reprints\nCNBC Councils\nSupply Chain Values\nCNBC on Peacock\nJoin the CNBC Panel\nDigital Products\nNews Releases\nClosed Captioning\nCorrections\nAbout CNBC\nInternships\nSite Map\nAd Choices\nCareers\nHelp\nContact\nNews TipsGot a confidential news tip? We want to hear from you.Get In Touch\nCNBC NewslettersSign up for free newsletters and get more CNBC delivered to your inboxSign Up NowGet this delivered to your inbox, and more info about our products and services.\nAdvertise With UsPlease Contact Us\nPrivacy Policy\nCA Notice\nTerms of Service\nBody:\nPolitical pressure is mounting against theFederal Reserve Chair Jerome Powell, and yet theFedis expected to holdinterest ratessteady at the end of its two-day meeting this week.\nDespite a wave of recent attacks on Powell from PresidentDonald Trump, futures market pricing is implying virtually no chance of an interest rate cut, according to the CME Group’sFedWatchgauge.\nThe president has argued that maintaining a federal funds rate that is too high makes it harder for businesses and consumers to borrow, adding more strain to the U.S. economy. The fed funds rate sets what banks charge each other for overnight lending, but alsoaffects many of the borrowing and savings ratesmost Americans see every day.\nMore from Personal Finance:Here’s the inflation breakdown for May 2025What’s happening with unemployed Americans — in five chartsThe economic cost of Trump, Harvard battle over student visas\nWith a rate cut likely postponeduntil at least September, consumers struggling under the weight of high prices and highborrowing costsaren’t getting much relief, experts say.\n“The combination of high interest rates, stubborn inflation and economic uncertainty is a pretty challenging one,” said Matt Schulz, chief credit analyst at LendingTree. “Most Americans don’t have a ton of wiggle room and today they have even less.”\nFrom credit cards and mortgage rates to auto loans and savings accounts, here’s a look at how the Fed plays a role in your finances.\nCredit card debt continues to be a pain point for consumers struggling to keep up with high prices. Since mostcredit cardshave a variable rate, there’s a direct connection to the Fed’s benchmark.\nBut even with the central bank on the sidelines, credit card rates have edged higher. The average annual percentage rate is currently just over 20%, according to Bankrate, not far from last year’sall-time high.\n“This is a sign of banks trying to protect themselves from the risk that is out there in these uncertain times,” Schulz said. However, in this case, there is something consumers can do about higher APRs.\n“The truth is that people have way more power over the rates they pay than they think they do, especially if they have good credit,” Schulz said.\nRather than waitfor a rate cut that may be months away, borrowers could switch now to a zero-interest balance transfer credit card or consolidate and pay off high-interest credit cards with a lower-ratepersonal loan, he said.\nSince 15- and 30-year mortgages are largely tied to Treasury yields and the economy, those rates haven’t moved much — and that hasn’t helped would-be buyers.\nThe average rate for a 30-year, fixed-rate mortgage has stayed within the same narrow range for months and is currently near 6.9%, according to Bankrate. Tack on thenationwide problemof limited inventory andhousing affordabilityremains a key issue, regardless of the Fed’s next move.\n“I don’t see any major changes coming in the immediate future, meaning that those shopping for a home this summer should expect rates to remain relatively high,” Schulz said.\nAuto loan ratesare fixed, and not directly tied to the Fed. But payments are getting bigger becausecar pricesare rising, in part due to impacts from Trump’strade policy.\nCurrently, the average rate on a five-year new car loan is 7.24%, according to Bankrate.\nThe growth in median car payments is outpacing both new and used car prices, according to separate data from Bank of America. Now, of those households with a monthly car payment, 20% paymore than $1,000 a month.\n“Combine that with the potential for tariffs to drive auto prices even higher, and it adds up to a really challenging time to buy a car,” Schulz said. “However, shopping for the best rate and getting approved for financing before you ever set foot in the dealership can bring significant savings,” he added.\nFederal student loan ratesare set once a year, based in part on the last10-year Treasury noteauction in May and fixed for the life of the loan, so most borrowers are somewhat shielded from Fed moves and recent economic turmoil.\nCurrent interest rates on undergraduate federal student loans made through June 30 are at 6.53%. Starting July 1, the interest rates will be 6.39%.\nAlthough borrowers with existing federalstudent debtbalances won’t see their rates change, many are now facing otherheadwindsand fewerfederal loan forgivenessoptions.\nOn the upside, top-yielding onlinesavingsaccounts still offer above-average returns and currently pay more than 4%, according to Bankrate.\nWhile the central bank has no direct influence on deposit rates, the yields tend to be correlated to changes in the target federal funds rate — so holding that rate unchanged has kept savings rates elevated, for now.\n“The thing that is lost in this, is that savers, including millions of retirees, are actually earning good income on their savings, provided they have their money parked in a competitive place,” said Greg McBride, Bankrate’s chief financial analyst.\nSubscribe to CNBC on YouTube.\nGot a confidential news tip? We want to hear from you.\nSign up for free newsletters and get more CNBC delivered to your inbox\nGet this delivered to your inbox, and more info about our products and services.\n©2025CNBC LLC. All Rights Reserved.A Division of NBCUniversal\nData is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.\nData also provided by\nThis Cookie Notice (“Notice”) explains how NBCUniversal andits affiliates(“NBCUniversal” or “we”), along with our partners, including advertisers and vendors, use cookies and similar tracking technologies when you use our websites, applications, such as games, interactive TV, voice-activated assistants, and other services that link to this policy, as well as connected devices, including those used in our theme parks (“Services”). This Notice provides more information about these technologies, your choices, and is part of the NBCUniversal Privacy Policy availablehere. You should read the Privacy Policy and this Notice for a full picture of NBCUniversal’s use of your information.\nWHAT ARE COOKIES AND HOW ARE THEY USED?\nLike many companies, we use cookies (small text files placed on your computer or device) and other tracking technologies on the Services (referred to together from this point forward as “Cookies”, unless otherwise stated), including HTTP cookies, HTML5 and Flash local storage/flash cookies, web beacons/GIFs, embedded scripts, ETags/cache browsers, and software development kits.\nFirst-party Cookies\nFirst-party Cookies are placed by us (including through the use of third-party service providers) and are used to allow you to use the Services and their features and to assist in analytics activities.\nThird-party Cookies\nCertain third parties may place their Cookies on your device and use them to recognize your device when you visit the Services and when you visit other websites or online services. These third parties collect and use this information pursuant to their own privacy policies. Third-party Cookies enable certain features or functionalities, and advertising, to be provided on the Services.\nTypes of Cookies\nThe Services use the following types of first and third-party Cookies for these purposes:\nStrictly Necessary Cookies:These Cookies are required for Service functionality, including for system administration, security and fraud prevention, and to enable any purchasing capabilities. You can set your browser to block these Cookies, but some parts of the site may not function properly.\nInformation Storage and Access:These Cookies allow us and our partners to store and access information on the device, such as device identifiers.\nMeasurement and Analytics:These Cookies collect data regarding your usage of and performance of the Services, apply market research to generate audiences, and measure the delivery and effectiveness of content and advertising. We and our third-party vendors use these Cookies to perform analytics, so we can improve the content and user experience, develop new products and services, and for statistical purposes. They are also used to recognize you and provide further insights across platforms and devices for the above purposes.\nPersonalization Cookies:These Cookies enable us to provide certain features, such as determining if you are a first-time visitor, capping message frequency, remembering choices you have made (e.g., your language preferences, time zone), and assist you with logging in after registration (including across platforms and devices).  These Cookies also allow your device to receive and send information, so you can see and interact with ads and content.\nContent Selection and Delivery Cookies:Data collected under this category can also be used to select and deliver personalized content, such as news articles and videos.\nAd Selection and Delivery Cookies:These Cookies are used to collect data about your browsing habits, your use of the Services, your preferences, and your interaction with advertisements across platforms and devices for the purpose of delivering interest-based advertising content on the Services and on third-party sites. Third-party sites and services also use interest-based Advertising Cookies to deliver content, including advertisements relevant to your interests on the Services and third-party services. If you reject these Cookies, you may see contextual advertising that may be less relevant to you.\nSocial Media Cookies:These Cookies are set by social media platforms on the Services to enable you to share content with your friends and networks. Social media platforms have the ability to track your online activity outside of the Services. This may impact the content and messages you see on other services you visit.\nWe and third parties may associate Measurement And Analytics Cookies, Personalization Cookies, Content Selection, Delivery Cookies, and Reporting, Ad Selection, Delivery and Reporting Cookies, and Social Media Cookies with other information we have about you.\nCOOKIE MANAGEMENT\nDepending on where you live, you may be able to adjust your Cookie preferences at any time via the “Cookie Settings” link in the footer of relevant websites. You can also use the methods described below to manage Cookies. You must take such steps on each browser or device that you use. If you replace, change or upgrade your browser or device, or delete your cookies, you may need to use these opt-out tools again. As some Cookie-management solutions also rely on Cookies, please adjust your browser Cookie settings carefully, following the relevant instructions below.\nBrowser Controls: You may be able to disable and manage some Cookies through your browser settings. If you use multiple browsers on the same device, you will need to manage your settings for each browser. Please click on any of the below browser links for instructions:\nGoogle ChromeApple SafariMozila FirefoxMicrosoft Internet Explorer\nIf the browser you use is not listed above, please refer to your browser’s help menu for information on how to manage Cookies. Please be aware that disabling cookies will not disable other analytics tools we may use to collect information about you or your use of our Services.\nAnalytics Provider Opt-Outs:To disable analytics Cookies you can use the browser controls discussed above or, for some of our providers, you can use their individual opt-out mechanisms:\nGoogle’s Privacy PolicyandGoogle Analytics Opt-OutOmniture’s Privacy PolicyandOmniture’s Opt-OutMixpanel’s Privacy PolicyandMixpanel’s Opt-Out\nThe above are examples of our analytics providers and this is not an exhaustive list. We are not responsible for the effectiveness of any other providers’ opt-out mechanisms.\nFlash Local Storage:These cookies are also known as local shared objects and may be used to store your preferences or display content by us, advertisers and other third-parties. Flash cookies need to be deleted in the storage section of your Flash Player Settings Manager.\nInterest-Based Advertising:Most third-party advertisers offer a way to opt out of their interest-based advertising. For more information or to opt out of receiving interest-based advertising from participating third-party advertisers, depending on your country of residence, please visit:\nDigital Advertising Alliance in the USDigital Advertising Alliance of CanadaEuropean Interactive Digital Advertising AllianceAustralian Digital Advertising Alliance\nYou can also opt out of some of the advertising providers we use by visiting their opt-out pages:\nGoogle’s Privacy PolicyandGoogle Analytics Opt-Out PageFacebook Privacy PolicyandFacebook’s Opt-Out PageTwitter Privacy PolicyandTwitter’s Opt-Out PageLiveramp’s Privacy PolicyandLiveramp Opt-Out Page\nThese are examples of our advertising providers and this is not an exhaustive list. In addition, we are not responsible for the effectiveness of any of these providers’ opt-out mechanisms.\nAfter you opt out, you will still see advertisements, but they may not be as relevant to you.\nMobile Settings:You may manage the collection of information for interest-based advertising purposes in mobile apps via the device’s settings, including managing the collection of location data. To opt out of mobile ad tracking from Nielsen or other third parties, you can do so by selecting the “Limit Ad Tracking” (for iOS devices) or “Opt out of Ads Personalization” (for Android devices) options in your device settings.\nConnected Devices:For connected devices, such as smart TVs or streaming devices, you should review the device’s settings and select the option that allows you to disable automatic content recognition or ad tracking.  Typically, to opt out, such devices require you to select options like “limit ad tracking” or to disable options such as “interest-based advertising,” “interactive TV,” or “smart interactivity”.  These settings vary by device type.\nCross-Device Tracking:If you would like to opt out of our browser-based cross-device tracking for advertising purposes, you may do so by using the various methods described above.  You must opt out separately on each device and each browser that you use. For more information about cross-device matching, please visit the Network Advertising Initiative or the Digital Advertising Alliance. If you opt out of cross-device tracking for advertising purposes, we may still conduct cross-device tracking for other purposes, such as analytics.\nConsequences of Deactivation of Cookies: If you disable or remove Cookies, some parts of the Services may not function properly. Information may still be collected and used for other purposes, such as research, online services analytics or internal operations, and to remember your opt-out preferences.\nCONTACT US\nFor inquiries about this Cookies Notice, please contact us atPrivacy@nbcuni.comor Chief Privacy Officer, NBCUniversal Legal Department, 30 Rockefeller Plaza, New York, NY 10112, US.\nFor inquiries from users who reside in the European Economic Area, the United Kingdom or Switzerland, please contact us atPrivacy@nbcuni.comor Privacy, Legal Department, Central Saint Giles, St Giles High Street, London, WC2H 8NU, UK\nCHANGES TO THIS NOTICE\nThis Notice may be revised occasionally and in accordance with legal requirements. Please revisit this Cookie Notice regularly to stay informed about our and our analytic and advertising partners’ use of Cookies.\nThese Cookies are required for Service functionality, including security and fraud prevention, and to enable any purchasing capabilities. You can set your browser to block these Cookies, but some parts of the site may not function properly."
  },
  {
    "title": "Here are the 4 big things we’re watching in the stock market in the week ahead",
    "url": "https://www.cnbc.com/2025/06/15/the-4-big-things-were-watching-in-the-stock-market-in-the-week-ahead.html",
    "date": "2025-06-15",
    "content": "Here are the 4 big things we’re watching in the stock market in the week ahead\nSummary:\nPre-Markets\nU.S. Markets\nEurope Markets\nChina Markets\nAsia Markets\nWorld Markets\nCurrencies\nCryptocurrency\nFutures & Commodities\nBonds\nFunds & ETFs\nEconomy\nFinance\nHealth & Science\nMedia\nReal Estate\nEnergy\nClimate\nTransportation\nIndustrials\nRetail\nWealth\nSports\nLife\nSmall Business\nPersonal Finance\nFintech\nFinancial Advisors\nOptions Action\nETF Street\nBuffett Archive\nEarnings\nTrader Talk\nCybersecurity\nAI\nEnterprise\nInternet\nMedia\nMobile\nSocial Media\nCNBC Disruptor 50\nTech Guide\nWhite House\nPolicy\nDefense\nCongress\nExpanding Opportunity\nEurope Politics\nChina Politics\nAsia Politics\nWorld Politics\nLatest Video\nFull Episodes\nLivestream\nTop Video\nLive Audio\nEurope TV\nAsia TV\nCNBC Podcasts\nCEO Interviews\nDigital Originals\nTrust Portfolio\nAnalysis\nTrade Alerts\nMeeting Videos\nHomestretch\nJim’s Columns\nEducation\nSubscribe\nSign In\nPro News\nLivestream\nFull Episodes\nStock Screener\nMarket Forecast\nOptions Investing\nChart Investing\nStock Lists\nSubscribe\nSign In\nMake It\nselect\nUSA\nINTL\nLivestream\nLivestream\nThe secret AI sauce behind Meta stock’s 683% rise since the dark days of 2022\nThe Fed’s outlook for inflation and jobs shows the bind it’s in — plus, Amazon’s robotaxi move\nAre cybersecurity stocks a new safety trade? What the Israel-Iran conflict shows\nEli Lilly looks beyond its blockbuster obesity drugs with another smart deal\nIs the U.S. consumer OK? Fed chief Powell will soon be the latest to weigh in\nSubscribe to CNBC PRO\nSubscribe to Investing Club\nLicensing & Reprints\nCNBC Councils\nSupply Chain Values\nCNBC on Peacock\nJoin the CNBC Panel\nDigital Products\nNews Releases\nClosed Captioning\nCorrections\nAbout CNBC\nInternships\nSite Map\nAd Choices\nCareers\nHelp\nContact\nNews TipsGot a confidential news tip? We want to hear from you.Get In Touch\nCNBC NewslettersSign up for free newsletters and get more CNBC delivered to your inboxSign Up NowGet this delivered to your inbox, and more info about our products and services.\nAdvertise With UsPlease Contact Us\nPrivacy Policy\nCA Notice\nTerms of Service\nBody:\nWall Street is heading into a holiday-shortened week of trading — but there’s unlikely to be a shortage of news for investors to process thanks to heightened geopolitical tensions and a pivotal Federal Reserve meeting.\nGot a confidential news tip? We want to hear from you.\nSign up for free newsletters and get more CNBC delivered to your inbox\nGet this delivered to your inbox, and more info about our products and services.\n©2025CNBC LLC. All Rights Reserved.A Division of NBCUniversal\nData is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.\nData also provided by\nThis Cookie Notice (“Notice”) explains how NBCUniversal andits affiliates(“NBCUniversal” or “we”), along with our partners, including advertisers and vendors, use cookies and similar tracking technologies when you use our websites, applications, such as games, interactive TV, voice-activated assistants, and other services that link to this policy, as well as connected devices, including those used in our theme parks (“Services”). This Notice provides more information about these technologies, your choices, and is part of the NBCUniversal Privacy Policy availablehere. You should read the Privacy Policy and this Notice for a full picture of NBCUniversal’s use of your information.\nWHAT ARE COOKIES AND HOW ARE THEY USED?\nLike many companies, we use cookies (small text files placed on your computer or device) and other tracking technologies on the Services (referred to together from this point forward as “Cookies”, unless otherwise stated), including HTTP cookies, HTML5 and Flash local storage/flash cookies, web beacons/GIFs, embedded scripts, ETags/cache browsers, and software development kits.\nFirst-party Cookies\nFirst-party Cookies are placed by us (including through the use of third-party service providers) and are used to allow you to use the Services and their features and to assist in analytics activities.\nThird-party Cookies\nCertain third parties may place their Cookies on your device and use them to recognize your device when you visit the Services and when you visit other websites or online services. These third parties collect and use this information pursuant to their own privacy policies. Third-party Cookies enable certain features or functionalities, and advertising, to be provided on the Services.\nTypes of Cookies\nThe Services use the following types of first and third-party Cookies for these purposes:\nStrictly Necessary Cookies:These Cookies are required for Service functionality, including for system administration, security and fraud prevention, and to enable any purchasing capabilities. You can set your browser to block these Cookies, but some parts of the site may not function properly.\nInformation Storage and Access:These Cookies allow us and our partners to store and access information on the device, such as device identifiers.\nMeasurement and Analytics:These Cookies collect data regarding your usage of and performance of the Services, apply market research to generate audiences, and measure the delivery and effectiveness of content and advertising. We and our third-party vendors use these Cookies to perform analytics, so we can improve the content and user experience, develop new products and services, and for statistical purposes. They are also used to recognize you and provide further insights across platforms and devices for the above purposes.\nPersonalization Cookies:These Cookies enable us to provide certain features, such as determining if you are a first-time visitor, capping message frequency, remembering choices you have made (e.g., your language preferences, time zone), and assist you with logging in after registration (including across platforms and devices).  These Cookies also allow your device to receive and send information, so you can see and interact with ads and content.\nContent Selection and Delivery Cookies:Data collected under this category can also be used to select and deliver personalized content, such as news articles and videos.\nAd Selection and Delivery Cookies:These Cookies are used to collect data about your browsing habits, your use of the Services, your preferences, and your interaction with advertisements across platforms and devices for the purpose of delivering interest-based advertising content on the Services and on third-party sites. Third-party sites and services also use interest-based Advertising Cookies to deliver content, including advertisements relevant to your interests on the Services and third-party services. If you reject these Cookies, you may see contextual advertising that may be less relevant to you.\nSocial Media Cookies:These Cookies are set by social media platforms on the Services to enable you to share content with your friends and networks. Social media platforms have the ability to track your online activity outside of the Services. This may impact the content and messages you see on other services you visit.\nWe and third parties may associate Measurement And Analytics Cookies, Personalization Cookies, Content Selection, Delivery Cookies, and Reporting, Ad Selection, Delivery and Reporting Cookies, and Social Media Cookies with other information we have about you.\nCOOKIE MANAGEMENT\nDepending on where you live, you may be able to adjust your Cookie preferences at any time via the “Cookie Settings” link in the footer of relevant websites. You can also use the methods described below to manage Cookies. You must take such steps on each browser or device that you use. If you replace, change or upgrade your browser or device, or delete your cookies, you may need to use these opt-out tools again. As some Cookie-management solutions also rely on Cookies, please adjust your browser Cookie settings carefully, following the relevant instructions below.\nBrowser Controls: You may be able to disable and manage some Cookies through your browser settings. If you use multiple browsers on the same device, you will need to manage your settings for each browser. Please click on any of the below browser links for instructions:\nGoogle ChromeApple SafariMozila FirefoxMicrosoft Internet Explorer\nIf the browser you use is not listed above, please refer to your browser’s help menu for information on how to manage Cookies. Please be aware that disabling cookies will not disable other analytics tools we may use to collect information about you or your use of our Services.\nAnalytics Provider Opt-Outs:To disable analytics Cookies you can use the browser controls discussed above or, for some of our providers, you can use their individual opt-out mechanisms:\nGoogle’s Privacy PolicyandGoogle Analytics Opt-OutOmniture’s Privacy PolicyandOmniture’s Opt-OutMixpanel’s Privacy PolicyandMixpanel’s Opt-Out\nThe above are examples of our analytics providers and this is not an exhaustive list. We are not responsible for the effectiveness of any other providers’ opt-out mechanisms.\nFlash Local Storage:These cookies are also known as local shared objects and may be used to store your preferences or display content by us, advertisers and other third-parties. Flash cookies need to be deleted in the storage section of your Flash Player Settings Manager.\nInterest-Based Advertising:Most third-party advertisers offer a way to opt out of their interest-based advertising. For more information or to opt out of receiving interest-based advertising from participating third-party advertisers, depending on your country of residence, please visit:\nDigital Advertising Alliance in the USDigital Advertising Alliance of CanadaEuropean Interactive Digital Advertising AllianceAustralian Digital Advertising Alliance\nYou can also opt out of some of the advertising providers we use by visiting their opt-out pages:\nGoogle’s Privacy PolicyandGoogle Analytics Opt-Out PageFacebook Privacy PolicyandFacebook’s Opt-Out PageTwitter Privacy PolicyandTwitter’s Opt-Out PageLiveramp’s Privacy PolicyandLiveramp Opt-Out Page\nThese are examples of our advertising providers and this is not an exhaustive list. In addition, we are not responsible for the effectiveness of any of these providers’ opt-out mechanisms.\nAfter you opt out, you will still see advertisements, but they may not be as relevant to you.\nMobile Settings:You may manage the collection of information for interest-based advertising purposes in mobile apps via the device’s settings, including managing the collection of location data. To opt out of mobile ad tracking from Nielsen or other third parties, you can do so by selecting the “Limit Ad Tracking” (for iOS devices) or “Opt out of Ads Personalization” (for Android devices) options in your device settings.\nConnected Devices:For connected devices, such as smart TVs or streaming devices, you should review the device’s settings and select the option that allows you to disable automatic content recognition or ad tracking.  Typically, to opt out, such devices require you to select options like “limit ad tracking” or to disable options such as “interest-based advertising,” “interactive TV,” or “smart interactivity”.  These settings vary by device type.\nCross-Device Tracking:If you would like to opt out of our browser-based cross-device tracking for advertising purposes, you may do so by using the various methods described above.  You must opt out separately on each device and each browser that you use. For more information about cross-device matching, please visit the Network Advertising Initiative or the Digital Advertising Alliance. If you opt out of cross-device tracking for advertising purposes, we may still conduct cross-device tracking for other purposes, such as analytics.\nConsequences of Deactivation of Cookies: If you disable or remove Cookies, some parts of the Services may not function properly. Information may still be collected and used for other purposes, such as research, online services analytics or internal operations, and to remember your opt-out preferences.\nCONTACT US\nFor inquiries about this Cookies Notice, please contact us atPrivacy@nbcuni.comor Chief Privacy Officer, NBCUniversal Legal Department, 30 Rockefeller Plaza, New York, NY 10112, US.\nFor inquiries from users who reside in the European Economic Area, the United Kingdom or Switzerland, please contact us atPrivacy@nbcuni.comor Privacy, Legal Department, Central Saint Giles, St Giles High Street, London, WC2H 8NU, UK\nCHANGES TO THIS NOTICE\nThis Notice may be revised occasionally and in accordance with legal requirements. Please revisit this Cookie Notice regularly to stay informed about our and our analytic and advertising partners’ use of Cookies.\nThese Cookies are required for Service functionality, including security and fraud prevention, and to enable any purchasing capabilities. You can set your browser to block these Cookies, but some parts of the site may not function properly."
  }
]