[
  "EDT\nShare\nAlthough swings in net exports have affected the data, recent indicators suggest that economic activity has continued to expand at a solid pace.",
  "The unemployment rate remains low, and labor market conditions remain solid.",
  "Inflation remains somewhat elevated.\nThe Committee seeks to achieve maximum employment and inflation at the rate of 2 percent over the longer run.",
  "The Committee is strongly committed to supporting maximum employment and returning inflation to its 2 percent objective.\nIn assessing the appropriate stance of monetary policy, the Committee will continue to monitor the implications of incoming information for the economic outlook.",
  "The Committee would be prepared to adjust the stance of monetary policy as appropriate if risks emerge that could impede the attainment of the Committee's goals.",
  "The Committee's assessments will take into account a wide range of information, including readings on labor market conditions, inflation pressures and inflation expectations, and financial and international developments.\nVoting for the monetary policy action were Jerome H.",
  "Federal Reserve on Wednesday kept interest rates in a range between 4.25%-4.5% and kept two cuts in 2025 on the table.\nInflation in the U.S., measured by the personal consumption expenditures price index, will rise beyond 3% in 2025, according to an updated Fed forecast.\nU.S.",
  "Europe’s Stoxx 600 index fell.\nU.S President Donald Trump insisted he had not yet decided whether to order a U.S.",
  "Federal Reserve Chair Jerome Powell’spost-meeting press conference, the topic of tariffs — specifically, their impact on prices — was a recurring one.\n“Everyone that I know is forecasting a meaningful increase in inflation in coming months from tariffs because someone has to pay for the tariffs,” Powell said.",
  "“And some of it will fall on the end consumer.”\nGranted, recent economic data has been upbeat, suggesting the U.S.",
  "economy has been able to — and could still — escape from tariffs mostly unscathed.\nIn May, a better-than-expected139,000 jobs were addedand the unemployment rate was unchanged at 4.2%.Consumer sentiment in early Junewas much more optimistic than forecast, according to a University of Michigan survey.",
  "And, most crucially,inflation in May— based on the consumer price index — ticked up just 0.1% for the month, lower than estimated.\nBut that string of positive data might have to thank the slow process by which tariffs move through the economy.\n“It takes some time for tariffs to work their way through the chain of distribution to the end consumer.",
  "economy weakening, Powell acknowledged growth will slow “eventually.” In other words, stagflation — the toxic mix of higher prices and slower growth — could be a possibility in the months ahead.\nThe song “I Got Summer on My Mind” went viral in 2022.",
  "Earlier Wednesday, President Donald Trump said the fed funds rate should be at least 2 percentage points lower, and again slammed Chair Jerome Powell,calling him “stupid.”\nFed hikes inflation and lowers growth forecastsInflation in the U.S., measured by the personal consumption expenditures price index, will rise beyond 3% in 2025, according to an updated Fed forecast.",
  "The Fed also sees economic growth slowing to 1.4% this year, down from an earlier estimate of 1.7%.",
  "annual inflation coming in at anexpected 3.4% in May.\nTrump says he hasn’t decided on Iran strikesFor the second time in two days, Trump on Wednesdaymet his national security team in the White Houseamid the Israel-Iran conflict.",
  "Ambassador to Israel Mike Huckabee said evacuation flights and cruise ship departures were being arranged for American citizens seeking to leave Israel.\n[PRO]‘Profound impact’ on oil market: JPMorganThe current jump in oil prices because of the simmering conflict in the Middle East might not lead to a long-term price shock, according to historical data analyzed byJPMorgan.",
  "and European Union are running out of time to strike a deal on trade tariffs — and analysts say several key sticking points could make an agreement impossible.\nNegotiations have been slow since both the U.S.",
  "and EU temporarily cut duties on each other until July 9.",
  "Here’s how Wall Street is reacting to the Fed’s updated rate cut outlook\nSummary:\nPre-Markets\nU.S.",
  "Fed sees preferred inflation gauge topping 3%,  higher than previous forecast\nSummary:\nPre-Markets\nU.S.",
  "The latter is a gauge Fed officials believe to be a better measure of longer-term trends.\nCentral bank officials also see further slowing in economic growth, projecting the gross domestic project expanding just 1.4% this year.",
  "In March, they expected a 1.7% pace in GDP growth.\nFed ChairJerome Powellsaid in the post-meeting news conference that the recent uptick in inflation expectations could be tied to tariffs.\n“Everyone that I know is forecasting a meaningful increase in inflation in coming months from tariffs because someone has to pay for the tariffs,” Powell said.",
  "And some of it will fall on the end consumer,” he said.\nFed officials have been reluctant to lower rates, worrying that Trump’s tariffs could cause inflation to reaccelerate in the coming months. The conflict between Israel and Iran adds another wild card to the policy mix, as high oil prices could prevent the Fed from easing policy.\nStill, the so-called dot plot — which indicates individual members’ expectations for rates — showed officials see their benchmark lending rate falling to 3.9% by the end of 2025.",
  "“With the uncertainty around tariffs and how that could impact inflation readings in the month ahead, there’s an ongoing sense of another shoe about to drop,” McBride said.\nMore from Personal Finance:Welcome to the zoo.",
  "Even though the central banklowered its benchmark ratethree times in 2024, those consumer rates are still elevated, and are mostly staying high, for now.\n“Borrowing rates are high, with mortgage rates near 7%, many home equity lines of credit in double-digit interest rate territory, and the average credit card rate still above 20%,” McBride said.",
  "“But savers continue to be rewarded with inflation-beating returns on the top-yielding savings accounts, money market accounts, and certificates of deposit.",
  "Retirees, in particular, are earning good income on their hard-earned savings.”\nManycredit cardshave a variable rate, so there’s a direct connection to the Fed’s benchmark.\nWith a rate cut likely postponeduntil at least September, the average credit card annual percentage rate is currently just over 20%, according to Bankrate — not far from last year’sall-time high.",
  "the Fed is one of the most significant.\nWith the Fed’s benchmark holding steady, the average rate on a five-year new car loan was 7.3% in May, near a record high,",
  "the average auto loan rate forused carswas 11%, according to Edmunds.\nButcar pricesare also rising — in part due to pressure from Trump’stariffs on imported vehicles— leaving car buyers with bigger monthly payments and a growing affordability problem.",
  "Starting July 1, the interest rates will be 6.39%.\nAlthough borrowers with existing federalstudent debtbalances won’t see their rates change, many are now facing otherheadwindsand fewerfederal loan forgivenessoptions.\nWhile the central bank has no direct influence on deposit rates, the yields tend to be correlated to changes in the target federal funds rate.\n“Yields for CDs and high-yield savings accounts aren’t at the sky-high levels they were a year ago,",
  "they’re still really strong,” said LendingTree’s Schulz.",
  "However, the committee approved the policy statement unanimously.\nEconomic projections from meeting participants pointed to further stagflationary pressures, with participants seeing the gross domestic product advancing at a 1.4% pace in 2025 and inflation hitting 3%.\nThe revised forecasts from the last update in March represented a decrease of 0.3 percentage point for GDP and an increase of the same amount for the personal consumption expenditures price index.",
  "The unemployment outlook saw a small revision, up to 4.5%, or 0.1 percentage point higher than March and 0.3 percentage point above the current level.\nThe FOMC statement changed little from the May meeting.",
  "Broadly speaking, the economy grew at a “solid pace,” with “low” unemployment and “somewhat elevated” inflation, the committee said.\nMoreover, the committee indicated less concern about the gyrations of the economy and the clouds over White House trade policy.\n“Uncertainty about the economic outlook has diminished",
  ", has not softened.\nEarlier Wednesday, the president again slammed Powell and his colleagues for not easing.",
  "Trump said the fed funds rate should be at least 2 percentage points lower andderided Powell as “stupid”for not pushing the committee to cut.\nFed officials have been reluctant to move, fearful that tariffs Trump implemented this year could causeinflation in the coming months.",
  "Price gauges so far have not indicated that the duties are having much of an impact.",
  "A delay in feed-through of the tariffs along with softening consumer demand and a buildup of inventories ahead of the April 2 “liberation day” announcement havehelped deflect their impact.\n“Everyone that I know is forecasting a meaningful increase in inflation in coming months from tariffs because someone has to pay for the tariffs,” Powell said.\nTheconflict between Israel and Iranadds another wild card to the policy mix, withprospects of higher energy pricesa potential additional factor in keeping the Fed from cutting.",
  "The statement did not mention influence from the Middle East fighting.\nA gradually softening economy could provide incentive to cut later this year.\nRecent labor market data shows layoffs creeping higher, long-term unemployment also rising and consumers spending less.Retail sales tumbled nearly 1% in Mayand recent data has reflected a cooling housing market, with starts hitting their lowest level in five years.\n“Effectively they are sitting on their hands, waiting to see if tariffs increase inflation or the jobs market starts to falter, and whichever part of their dual mandate is impacted first will likely guide whichever direction they take,",
  "However, he said the market was surprised by the comment that uncertainty had “diminished.”\nFor Trump, though, the importance of lower rates stems from the high cost the government is paying to finance its $36 trillion debt.\nInterest on the debt is on track to total $1.2 trillion this year and exceeds all other budget items except Social Security and Medicare.",
  "The Fed last cut in December, and Treasury yields have held higher throughout the year, putting additional pressure ona budget deficitlikely to approach $2 trillion, or more than 6% of GDP.\nCorrection: The meeting participants expect gross domestic product to advance at a 1.4% pace in 2025.",
  "Trump says ‘stupid’ Powell ‘probably won’t cut’ rates when Fed meeting ends Wednesday\nSummary:\nPre-Markets\nU.S.",
  "doubting the central bank would cut.\nIn his latest in a series of attacks on Powell that go back years, Trump said the Fed’s key borrowing rate should be at least 2 percentage points lower.\n“So we have a stupid person.",
  "Frankly, you probably won’t cut today,” Trump said in impromptu remarks just outside the White House.",
  "he’s costing the country a fortune.”\nThe remarks came just about four hours before the rate-setting Federal Open Market Committee was to release its statement on interest rates, along with an update of where it sees policy and several key economic measures heading over the next several years.\nMarket pricing indicates no probability of a cut at this meeting, with the next move expected in September.",
  "“hundreds of billions” of dollars in financing costs that could be saved if the Fed would ease.\n“If he’s worried about inflation, that’s OK.",
  "Singapore time, Japan’sNikkei 225rose 0.77% even as the government reported a drop in exports in May,",
  ", lost 1.23%.\nExports from Japan fall in MayJapan exports in Maydeclined 1.7% year over year, according todata from Japan’s trade ministryreleased Wednesday.",
  "While that drop fares better than the 3.8% decline expected from a Reuters poll of economists, it’s still the steepest fall since September 2024 and reverses the 2% growth in April.",
  "dropped 11.1% from a year earlier,much worse than than the 1.8% fall in April.\nMeta trying to poach OpenAI staff: AltmanOn apodcastreleased Tuesday, OpenAI CEO Sam Altman said Meta hadsought to hire “a lot of people”from the artificial intelligence company, and had offered signing bonuses as high as $100 million —",
  "What to expect\nWhile any immediate movement on interest rates seems improbable, the Federal Reserve’s policy meeting, which concludes Wednesday, will feature important signals that still could move markets.\nAmong the biggest things to watch will be whether Federal Open Market Committee members stick with their previous forecast of two rate cuts this year, how they see inflation trending, and any reaction from ChairJerome Powellto what has become a concerted White House campaign for easier monetary policy.\nAs things stand heading into the meeting, markets are pricing in the next cut to come in September, which would be the one-year anniversary of a surprisingly aggressivehalf-percentage-point reductionthe FOMC instituted amid concerns over the labor market.",
  "slow interest rate cuts, CNBC Fed survey finds\nSummary:\nPre-Markets\nU.S.",
  "this will require some help in mitigating some of these sources of volatility.”\nThe help, he said, comes from trade deals and tax policy, with 29% saying the current tax bill in Congress makes them more optimistic about growth and 29% say it makes them more pessimistic",
  "43% say it has no effect on their growth outlook.\nYet 82% believe it will “somewhat” or “significantly increase” the federal budget deficit.\nA 54% majority expect the U.S.",
  "On average, those looking for a trade deal believe it will be signed within about five months.\n“While it appears that the worst-case scenario when it comes to tariffs will not happen, the best-case scenario still implies significantly higher tariffs and therefore higher inflation for an extended period,″ said Joel Naroff, president, Naroff Economics.\nThe Federal Reserve isexpected to stand pat at the June meetingand not cut rates until September.",
  "only one 25 basis point cut next year.\n“There are multiple cross currents from geopolitical events that the Fed will have to weigh,” said Constance Hunter, chief economist at the Economist Intelligence Unit.",
  "we expect slower growth will ultimately be what causes the Fed to move closer to a neutral stance.”\nAsked how the Fed would react to astagflationary outcomeof higher prices and weaker growth, 54% believe the central bank will cut rates",
  "That’s a bit more hawkish than May when 65% saw the Fed cutting.\nBy a slim margin, respondents don’t believe the Fed will face that dilemma: 43% believe tariffs will result in just “one-time price increases”",
  "32% say they create a broader inflationary problem.\nHowever, 61% say tariff inflation in future months will show up “more significantly” than it has,",
  "36% see it as appearing “only modestly.”\n“I expect (economic) moderation going forward as tariffs get incorporated into consumer prices and slower job growth due in part to a slower pace of immigration providing less fuel for aggregate disposable income,” said Jack Kleinhenz, chief economist at the National Retail Federation.\nAmid all those concerns, Mark Vitner, chief economist at Piedmont Crescent Capital & CAVU Securities, notes that the economy has remained “Resilient, Not ‘Tariffied.’”\n“There’s no shortage of reasons to worry — elevated interest rates, huge budget deficits, geopolitical flare-ups, tariff threats —",
  "economy keeps proving its doubters wrong.”\nHe added, “Consumers continue to spend, and businesses are doubling down on future-facing infrastructure: AI, life sciences, DefenseTech, and other emerging technologies.”\nIndeed, the outlook for stocks rose, with the S&P 500 now expected to hit 6,133 by year-end, for a modest 1.7% rise from current levels,",
  "a more robust 10% increase to 6,625 by the end of 2026.\n“Equity markets are near all-time highs in anticipation of certainty replacing uncertainty on tariffs, the 2017 tax cuts getting extended, deregulation, AI productivity, and Fed easing,” said Hank Smith, head of investment strategy, Haverford Trust Co.",
  "The average annual percentage rate is currently just over 20%, according to Bankrate, not far from last year’sall-time high.\n“This is a sign of banks trying to protect themselves from the risk that is out there in these uncertain times,” Schulz said.",
  "Tack on thenationwide problemof limited inventory andhousing affordabilityremains a key issue, regardless of the Fed’s next move.\n“I don’t see any major changes coming in the immediate future, meaning that those shopping for a home this summer should expect rates to remain relatively high,” Schulz said.\nAuto loan ratesare fixed, and not directly tied to the Fed.",
  "But payments are getting bigger becausecar pricesare rising, in part due to impacts from Trump’strade policy.\nCurrently, the average rate on a five-year new car loan is 7.24%, according to Bankrate.\nThe growth in median car payments is outpacing both new and used car prices, according to separate data from Bank of America."
]